/* automatically generated by rust-bindgen 0.71.1 */

use libc::{FILE, sockaddr};
#[cfg(unix)]
use libc::{addrinfo, mode_t};

pub const RD_KAFKA_VERSION: i32 = 34078975;
pub const RD_KAFKA_DEBUG_CONTEXTS : & [u8 ; 138] = b"all,generic,broker,topic,metadata,feature,queue,msg,protocol,cgrp,security,fetch,interceptor,plugin,consumer,admin,eos,mock,assignor,conf\0" ;
pub const RD_KAFKA_DESTROY_F_NO_CONSUMER_CLOSE: i32 = 8;
pub const RD_KAFKA_OFFSET_BEGINNING: i32 = -2;
pub const RD_KAFKA_OFFSET_END: i32 = -1;
pub const RD_KAFKA_OFFSET_STORED: i32 = -1000;
pub const RD_KAFKA_OFFSET_INVALID: i32 = -1001;
pub const RD_KAFKA_OFFSET_TAIL_BASE: i32 = -2000;
pub const RD_KAFKA_MSG_F_FREE: i32 = 1;
pub const RD_KAFKA_MSG_F_COPY: i32 = 2;
pub const RD_KAFKA_MSG_F_BLOCK: i32 = 4;
pub const RD_KAFKA_MSG_F_PARTITION: i32 = 8;
pub const RD_KAFKA_PURGE_F_QUEUE: i32 = 1;
pub const RD_KAFKA_PURGE_F_INFLIGHT: i32 = 2;
pub const RD_KAFKA_PURGE_F_NON_BLOCKING: i32 = 4;
pub const RD_KAFKA_EVENT_NONE: i32 = 0;
pub const RD_KAFKA_EVENT_DR: i32 = 1;
pub const RD_KAFKA_EVENT_FETCH: i32 = 2;
pub const RD_KAFKA_EVENT_LOG: i32 = 4;
pub const RD_KAFKA_EVENT_ERROR: i32 = 8;
pub const RD_KAFKA_EVENT_REBALANCE: i32 = 16;
pub const RD_KAFKA_EVENT_OFFSET_COMMIT: i32 = 32;
pub const RD_KAFKA_EVENT_STATS: i32 = 64;
pub const RD_KAFKA_EVENT_CREATETOPICS_RESULT: i32 = 100;
pub const RD_KAFKA_EVENT_DELETETOPICS_RESULT: i32 = 101;
pub const RD_KAFKA_EVENT_CREATEPARTITIONS_RESULT: i32 = 102;

    RD_KAFKA_RESP_ERR_GROUP_SUBSCRIBED_TO_TOPIC = 86,
    #[doc = " Broker failed to validate record"]
    RD_KAFKA_RESP_ERR_INVALID_RECORD = 87,
    #[doc = " There are unstable offsets that need to be cleared"]
    RD_KAFKA_RESP_ERR_UNSTABLE_OFFSET_COMMIT = 88,
    #[doc = " Throttling quota has been exceeded"]
    RD_KAFKA_RESP_ERR_THROTTLING_QUOTA_EXCEEDED = 89,
    #[doc = " There is a newer producer with the same transactionalId\n  which fences the current one"]
    RD_KAFKA_RESP_ERR_PRODUCER_FENCED = 90,
    #[doc = " Request illegally referred to resource that does not exist"]
    RD_KAFKA_RESP_ERR_RESOURCE_NOT_FOUND = 91,
    #[doc = " Request illegally referred to the same resource twice"]
    RD_KAFKA_RESP_ERR_DUPLICATE_RESOURCE = 92,
    #[doc = " Requested credential would not meet criteria for acceptability"]
    RD_KAFKA_RESP_ERR_UNACCEPTABLE_CREDENTIAL = 93,
    #[doc = " Indicates that the either the sender or recipient of a\n  voter-only request is not one of the expected voters"]
    RD_KAFKA_RESP_ERR_INCONSISTENT_VOTER_SET = 94,
    #[doc = " Invalid update version"]
    RD_KAFKA_RESP_ERR_INVALID_UPDATE_VERSION = 95,
    #[doc = " Unable to update finalized features due to server error"]
    RD_KAFKA_RESP_ERR_FEATURE_UPDATE_FAILED = 96,
    #[doc = " Request principal deserialization failed during forwarding"]
    RD_KAFKA_RESP_ERR_PRINCIPAL_DESERIALIZATION_FAILURE = 97,
    #[doc = " Unknown Topic Id"]
    RD_KAFKA_RESP_ERR_UNKNOWN_TOPIC_ID = 100,
    #[doc = " The member epoch is fenced by the group coordinator"]
    RD_KAFKA_RESP_ERR_FENCED_MEMBER_EPOCH = 110,
    #[doc = " The instance ID is still used by another member in the\n  consumer group"]
    RD_KAFKA_RESP_ERR_UNRELEASED_INSTANCE_ID = 111,
    #[doc = " The assignor or its version range is not supported by the consumer\n  group"]
    RD_KAFKA_RESP_ERR_UNSUPPORTED_ASSIGNOR = 112,
    #[doc = " The member epoch is stale"]
    RD_KAFKA_RESP_ERR_STALE_MEMBER_EPOCH = 113,
    #[doc = " Client sent a push telemetry request with an invalid or outdated\n  subscription ID."]
    RD_KAFKA_RESP_ERR_UNKNOWN_SUBSCRIPTION_ID = 117,
    #[doc = " Client sent a push telemetry request larger than the maximum size\n  the broker will accept."]
    RD_KAFKA_RESP_ERR_TELEMETRY_TOO_LARGE = 118,
    #[doc = " Client sent a push telemetry request larger than the maximum size\n  the broker will accept."]
    RD_KAFKA_RESP_ERR_END_ALL = 119,
}
#[doc = " @brief Error code value, name and description.\n        Typically for use with language bindings to automatically expose\n        the full set of librdkafka error codes."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rd_kafka_err_desc {
    #[doc = "< Error code"]
    pub code: rd_kafka_resp_err_t,
    #[doc = "< Error name, same as code enum sans prefix"]
    pub name: *const ::std::os::raw::c_char,
    #[doc = "< Human readable error description."]
    pub desc: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rd_kafka_err_desc"][::std::mem::size_of::<rd_kafka_err_desc>() - 24usize];
    ["Alignment of rd_kafka_err_desc"][::std::mem::align_of::<rd_kafka_err_desc>() - 8usize];
    ["Offset of field: rd_kafka_err_desc::code"]
        [::std::mem::offset_of!(rd_kafka_err_desc, code) - 0usize];
    ["Offset of field: rd_kafka_err_desc::name"]
        [::std::mem::offset_of!(rd_kafka_err_desc, name) - 8usize];
    ["Offset of field: rd_kafka_err_desc::desc"]
        [::std::mem::offset_of!(rd_kafka_err_desc, desc) - 16usize];
};
unsafe extern "C" {
    #[doc = " @brief Returns the full list of error codes."]
    pub fn rd_kafka_get_err_descs(errdescs: *mut *const rd_kafka_err_desc, cntp: *mut usize);
}
unsafe extern "C" {
    #[doc = " @brief Returns a human readable representation of a kafka error.\n\n @param err Error code to translate"]
    pub fn rd_kafka_err2str(err: rd_kafka_resp_err_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " @brief Returns the error code name (enum name).\n\n @param err Error code to translate"]
    pub fn rd_kafka_err2name(err: rd_kafka_resp_err_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " @brief Returns the last error code generated by a legacy API call\n        in the current thread.\n\n The legacy APIs are the ones using errno to propagate error value, namely:\n  - rd_kafka_topic_new()\n  - rd_kafka_consume_start()\n  - rd_kafka_consume_stop()\n  - rd_kafka_consume()\n  - rd_kafka_consume_batch()\n  - rd_kafka_consume_callback()\n  - rd_kafka_consume_queue()\n  - rd_kafka_produce()\n\n The main use for this function is to avoid converting system \\p errno\n values to rd_kafka_resp_err_t codes for legacy APIs.\n\n @remark The last error is stored per-thread, if multiple rd_kafka_t handles\n         are used in the same application thread the developer needs to\n         make sure rd_kafka_last_error() is called immediately after\n         a failed API call.\n\n @remark errno propagation from librdkafka is not safe on Windows\n         and should not be used, use rd_kafka_last_error() instead."]
    pub fn rd_kafka_last_error() -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Converts the system errno value \\p errnox to a rd_kafka_resp_err_t\n        error code upon failure from the following functions:\n  - rd_kafka_topic_new()\n  - rd_kafka_consume_start()\n  - rd_kafka_consume_stop()\n  - rd_kafka_consume()\n  - rd_kafka_consume_batch()\n  - rd_kafka_consume_callback()\n  - rd_kafka_consume_queue()\n  - rd_kafka_produce()\n\n @param errnox  System errno value to convert\n\n @returns Appropriate error code for \\p errnox\n\n @remark A better alternative is to call rd_kafka_last_error() immediately\n         after any of the above functions return -1 or NULL.\n\n @deprecated Use rd_kafka_last_error() to retrieve the last error code\n             set by the legacy librdkafka APIs.\n\n @sa rd_kafka_last_error()"]
    pub fn rd_kafka_errno2err(errnox: ::std::os::raw::c_int) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Returns the thread-local system errno\n\n On most platforms this is the same as \\p errno but in case of different\n runtimes between library and application (e.g., Windows static DLLs)\n this provides a means for exposing the errno librdkafka uses.\n\n @remark The value is local to the current calling thread.\n\n @deprecated Use rd_kafka_last_error() to retrieve the last error code\n             set by the legacy librdkafka APIs."]
    pub fn rd_kafka_errno() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Returns the first fatal error set on this client instance,\n        or RD_KAFKA_RESP_ERR_NO_ERROR if no fatal error has occurred.\n\n This function is to be used with the Idempotent Producer and \\c error_cb\n to detect fatal errors.\n\n Generally all errors raised by \\c error_cb are to be considered\n informational and temporary, the client will try to recover from all\n errors in a graceful fashion (by retrying, etc).\n\n However, some errors should logically be considered fatal to retain\n consistency; in particular a set of errors that may occur when using the\n Idempotent Producer and the in-order or exactly-once producer guarantees\n can't be satisfied.\n\n @param rk Client instance.\n @param errstr A human readable error string (nul-terminated) is written to\n               this location that must be of at least \\p errstr_size bytes.\n               The \\p errstr is only written to if there is a fatal error.\n @param errstr_size Writable size in \\p errstr.\n\n\n @returns RD_KAFKA_RESP_ERR_NO_ERROR if no fatal error has been raised, else\n          any other error code."]
    pub fn rd_kafka_fatal_error(
        rk: *mut rd_kafka_t,
        errstr: *mut ::std::os::raw::c_char,
        errstr_size: usize,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Trigger a fatal error for testing purposes.\n\n Since there is no practical way to trigger real fatal errors in the\n idempotent producer, this method allows an application to trigger\n fabricated fatal errors in tests to check its error handling code.\n\n @param rk Client instance.\n @param err The underlying error code.\n @param reason A human readable error reason.\n               Will be prefixed with \"test_fatal_error: \" to differentiate\n               from real fatal errors.\n\n @returns RD_KAFKA_RESP_ERR_NO_ERROR if a fatal error was triggered, or\n          RD_KAFKA_RESP_ERR__PREV_IN_PROGRESS if a previous fatal error\n          has already been triggered."]
    pub fn rd_kafka_test_fatal_error(
        rk: *mut rd_kafka_t,
        err: rd_kafka_resp_err_t,
        reason: *const ::std::os::raw::c_char,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @returns the error code for \\p error or RD_KAFKA_RESP_ERR_NO_ERROR if\n          \\p error is NULL."]
    pub fn rd_kafka_error_code(error: *const rd_kafka_error_t) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @returns the error code name for \\p error, e.g, \"ERR_UNKNOWN_MEMBER_ID\",\n          or an empty string if \\p error is NULL.\n\n @remark The lifetime of the returned pointer is the same as the error object.\n\n @sa rd_kafka_err2name()"]
    pub fn rd_kafka_error_name(error: *const rd_kafka_error_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " @returns a human readable error string for \\p error,\n          or an empty string if \\p error is NULL.\n\n @remark The lifetime of the returned pointer is the same as the error object."]
    pub fn rd_kafka_error_string(error: *const rd_kafka_error_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " @returns 1 if the error is a fatal error, indicating that the client\n          instance is no longer usable, else 0 (also if \\p error is NULL)."]
    pub fn rd_kafka_error_is_fatal(error: *const rd_kafka_error_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @returns 1 if the operation may be retried,\n          else 0 (also if \\p error is NULL)."]
    pub fn rd_kafka_error_is_retriable(error: *const rd_kafka_error_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @returns 1 if the error is an abortable transaction error in which case\n          the application must call rd_kafka_abort_transaction() and\n          start a new transaction with rd_kafka_begin_transaction() if it\n          wishes to proceed with transactions.\n          Else returns 0 (also if \\p error is NULL).\n\n @remark The return value of this method is only valid for errors returned\n         by the transactional API."]
    pub fn rd_kafka_error_txn_requires_abort(
        error: *const rd_kafka_error_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Free and destroy an error object.\n\n @remark As a conveniance it is permitted to pass a NULL \\p error."]
    pub fn rd_kafka_error_destroy(error: *mut rd_kafka_error_t);
}
unsafe extern "C" {
    #[doc = " @brief Create a new error object with error \\p code and optional\n        human readable error string in \\p fmt.\n\n This method is mainly to be used for mocking errors in application test code.\n\n The returned object must be destroyed with rd_kafka_error_destroy()."]
    pub fn rd_kafka_error_new(
        code: rd_kafka_resp_err_t,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> *mut rd_kafka_error_t;
}
#[doc = " @brief Generic place holder for a specific Topic+Partition.\n\n @sa rd_kafka_topic_partition_list_new()"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rd_kafka_topic_partition_s {
    #[doc = "< Topic name"]
    pub topic: *mut ::std::os::raw::c_char,
    #[doc = "< Partition"]
    pub partition: i32,
    #[doc = "< Offset"]
    pub offset: i64,
    #[doc = "< Metadata"]
    pub metadata: *mut ::std::os::raw::c_void,
    #[doc = "< Metadata size"]
    pub metadata_size: usize,
    #[doc = "< Opaque value for application use"]
    pub opaque: *mut ::std::os::raw::c_void,
    #[doc = "< Error code, depending on use."]
    pub err: rd_kafka_resp_err_t,
    #[doc = "< INTERNAL USE ONLY,\n   INITIALIZE TO ZERO, DO NOT TOUCH,\n   DO NOT COPY, DO NOT SHARE WITH OTHER\n   rd_kafka_t INSTANCES."]
    pub _private: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rd_kafka_topic_partition_s"]
        [::std::mem::size_of::<rd_kafka_topic_partition_s>() - 64usize];
    ["Alignment of rd_kafka_topic_partition_s"]
        [::std::mem::align_of::<rd_kafka_topic_partition_s>() - 8usize];
    ["Offset of field: rd_kafka_topic_partition_s::topic"]
        [::std::mem::offset_of!(rd_kafka_topic_partition_s, topic) - 0usize];
    ["Offset of field: rd_kafka_topic_partition_s::partition"]
        [::std::mem::offset_of!(rd_kafka_topic_partition_s, partition) - 8usize];
    ["Offset of field: rd_kafka_topic_partition_s::offset"]
        [::std::mem::offset_of!(rd_kafka_topic_partition_s, offset) - 16usize];
    ["Offset of field: rd_kafka_topic_partition_s::metadata"]
        [::std::mem::offset_of!(rd_kafka_topic_partition_s, metadata) - 24usize];
    ["Offset of field: rd_kafka_topic_partition_s::metadata_size"]
        [::std::mem::offset_of!(rd_kafka_topic_partition_s, metadata_size) - 32usize];
    ["Offset of field: rd_kafka_topic_partition_s::opaque"]
        [::std::mem::offset_of!(rd_kafka_topic_partition_s, opaque) - 40usize];
    ["Offset of field: rd_kafka_topic_partition_s::err"]
        [::std::mem::offset_of!(rd_kafka_topic_partition_s, err) - 48usize];
    ["Offset of field: rd_kafka_topic_partition_s::_private"]
        [::std::mem::offset_of!(rd_kafka_topic_partition_s, _private) - 56usize];
};
#[doc = " @brief Generic place holder for a specific Topic+Partition.\n\n @sa rd_kafka_topic_partition_list_new()"]
pub type rd_kafka_topic_partition_t = rd_kafka_topic_partition_s;
unsafe extern "C" {
    #[doc = " @brief Destroy a rd_kafka_topic_partition_t.\n @remark This must not be called for elements in a topic partition list."]
    pub fn rd_kafka_topic_partition_destroy(rktpar: *mut rd_kafka_topic_partition_t);
}
unsafe extern "C" {
    #[doc = " @brief Sets the offset leader epoch (use -1 to clear).\n\n @param rktpar Partition object.\n @param leader_epoch Offset leader epoch, use -1 to reset.\n\n @remark See KIP-320 for more information."]
    pub fn rd_kafka_topic_partition_set_leader_epoch(
        rktpar: *mut rd_kafka_topic_partition_t,
        leader_epoch: i32,
    );
}
unsafe extern "C" {
    #[doc = " @returns the offset leader epoch, if relevant and known,\n          else -1.\n\n @param rktpar Partition object.\n\n @remark See KIP-320 for more information."]
    pub fn rd_kafka_topic_partition_get_leader_epoch(
        rktpar: *const rd_kafka_topic_partition_t,
    ) -> i32;
}
#[doc = " @brief A growable list of Topic+Partitions.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rd_kafka_topic_partition_list_s {
    #[doc = "< Current number of elements"]
    pub cnt: ::std::os::raw::c_int,
    #[doc = "< Current allocated size"]
    pub size: ::std::os::raw::c_int,
    #[doc = "< Element array[]"]
    pub elems: *mut rd_kafka_topic_partition_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rd_kafka_topic_partition_list_s"]
        [::std::mem::size_of::<rd_kafka_topic_partition_list_s>() - 16usize];
    ["Alignment of rd_kafka_topic_partition_list_s"]
        [::std::mem::align_of::<rd_kafka_topic_partition_list_s>() - 8usize];
    ["Offset of field: rd_kafka_topic_partition_list_s::cnt"]
        [::std::mem::offset_of!(rd_kafka_topic_partition_list_s, cnt) - 0usize];
    ["Offset of field: rd_kafka_topic_partition_list_s::size"]
        [::std::mem::offset_of!(rd_kafka_topic_partition_list_s, size) - 4usize];
    ["Offset of field: rd_kafka_topic_partition_list_s::elems"]
        [::std::mem::offset_of!(rd_kafka_topic_partition_list_s, elems) - 8usize];
};
#[doc = " @brief A growable list of Topic+Partitions.\n"]
pub type rd_kafka_topic_partition_list_t = rd_kafka_topic_partition_list_s;
unsafe extern "C" {
    #[doc = " @brief Create a new list/vector Topic+Partition container.\n\n @param size  Initial allocated size used when the expected number of\n              elements is known or can be estimated.\n              Avoids reallocation and possibly relocation of the\n              elems array.\n\n @returns A newly allocated Topic+Partition list.\n\n @remark Use rd_kafka_topic_partition_list_destroy() to free all resources\n         in use by a list and the list itself.\n @sa     rd_kafka_topic_partition_list_add()"]
    pub fn rd_kafka_topic_partition_list_new(
        size: ::std::os::raw::c_int,
    ) -> *mut rd_kafka_topic_partition_list_t;
}
unsafe extern "C" {
    #[doc = " @brief Free all resources used by the list and the list itself."]
    pub fn rd_kafka_topic_partition_list_destroy(rkparlist: *mut rd_kafka_topic_partition_list_t);
}
unsafe extern "C" {
    #[doc = " @brief Add topic+partition to list\n\n @param rktparlist List to extend\n @param topic      Topic name (copied)\n @param partition  Partition id\n\n @returns The object which can be used to fill in additionals fields."]
    pub fn rd_kafka_topic_partition_list_add(
        rktparlist: *mut rd_kafka_topic_partition_list_t,
        topic: *const ::std::os::raw::c_char,
        partition: i32,
    ) -> *mut rd_kafka_topic_partition_t;
}
unsafe extern "C" {
    #[doc = " @brief Add range of partitions from \\p start to \\p stop inclusive.\n\n @param rktparlist List to extend\n @param topic      Topic name (copied)\n @param start      Start partition of range\n @param stop       Last partition of range (inclusive)"]
    pub fn rd_kafka_topic_partition_list_add_range(
        rktparlist: *mut rd_kafka_topic_partition_list_t,
        topic: *const ::std::os::raw::c_char,
        start: i32,
        stop: i32,
    );
}
unsafe extern "C" {
    #[doc = " @brief Delete partition from list.\n\n @param rktparlist List to modify\n @param topic      Topic name to match\n @param partition  Partition to match\n\n @returns 1 if partition was found (and removed), else 0.\n\n @remark Any held indices to elems[] are unusable after this call returns 1."]
    pub fn rd_kafka_topic_partition_list_del(
        rktparlist: *mut rd_kafka_topic_partition_list_t,
        topic: *const ::std::os::raw::c_char,
        partition: i32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Delete partition from list by elems[] index.\n\n @returns 1 if partition was found (and removed), else 0.\n\n @sa rd_kafka_topic_partition_list_del()"]
    pub fn rd_kafka_topic_partition_list_del_by_idx(
        rktparlist: *mut rd_kafka_topic_partition_list_t,
        idx: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Make a copy of an existing list.\n\n @param src   The existing list to copy.\n\n @returns A new list fully populated to be identical to \\p src"]
    pub fn rd_kafka_topic_partition_list_copy(
        src: *const rd_kafka_topic_partition_list_t,
    ) -> *mut rd_kafka_topic_partition_list_t;
}
unsafe extern "C" {
    #[doc = " @brief Set offset to \\p offset for \\p topic and \\p partition\n\n @returns RD_KAFKA_RESP_ERR_NO_ERROR on success or\n          RD_KAFKA_RESP_ERR__UNKNOWN_PARTITION if \\p partition was not found\n          in the list."]
    pub fn rd_kafka_topic_partition_list_set_offset(
        rktparlist: *mut rd_kafka_topic_partition_list_t,
        topic: *const ::std::os::raw::c_char,
        partition: i32,
        offset: i64,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Find element by \\p topic and \\p partition.\n\n @returns a pointer to the first matching element, or NULL if not found."]
    pub fn rd_kafka_topic_partition_list_find(
        rktparlist: *const rd_kafka_topic_partition_list_t,
        topic: *const ::std::os::raw::c_char,
        partition: i32,
    ) -> *mut rd_kafka_topic_partition_t;
}
unsafe extern "C" {
    #[doc = " @brief Sort list using comparator \\p cmp.\n\n If \\p cmp is NULL the default comparator will be used that\n sorts by ascending topic name and partition.\n\n \\p cmp_opaque is provided as the \\p cmp_opaque argument to \\p cmp.\n"]
    pub fn rd_kafka_topic_partition_list_sort(
        rktparlist: *mut rd_kafka_topic_partition_list_t,
        cmp: ::std::option::Option<
            unsafe extern "C" fn(
                a: *const ::std::os::raw::c_void,
                b: *const ::std::os::raw::c_void,
                cmp_opaque: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        cmp_opaque: *mut ::std::os::raw::c_void,
    );
}
#[repr(u32)]
#[doc = " @enum rd_kafka_vtype_t\n\n @brief Var-arg tag types\n\n @sa rd_kafka_producev()"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum rd_kafka_vtype_t {
    #[doc = "< va-arg sentinel"]
    RD_KAFKA_VTYPE_END = 0,
    #[doc = "< (const char *) Topic name"]
    RD_KAFKA_VTYPE_TOPIC = 1,
    #[doc = "< (rd_kafka_topic_t *) Topic handle"]
    RD_KAFKA_VTYPE_RKT = 2,
    #[doc = "< (int32_t) Partition"]
    RD_KAFKA_VTYPE_PARTITION = 3,
    #[doc = "< (void *, size_t) Message value (payload)"]
    RD_KAFKA_VTYPE_VALUE = 4,
    #[doc = "< (void *, size_t) Message key"]
    RD_KAFKA_VTYPE_KEY = 5,
    #[doc = "< (void *) Per-message application opaque\n            value. This is the same as\n            the _private field in\n            rd_kafka_message_t, also known\n            as the msg_opaque."]
    RD_KAFKA_VTYPE_OPAQUE = 6,
    #[doc = "< (int) RD_KAFKA_MSG_F_.. flags"]
    RD_KAFKA_VTYPE_MSGFLAGS = 7,
    #[doc = "< (int64_t) Milliseconds since epoch UTC"]
    RD_KAFKA_VTYPE_TIMESTAMP = 8,
    #[doc = "< (const char *, const void *, ssize_t)\n   Message Header"]
    RD_KAFKA_VTYPE_HEADER = 9,
    #[doc = "< (rd_kafka_headers_t *) Headers list"]
    RD_KAFKA_VTYPE_HEADERS = 10,
}
#[doc = " @brief VTYPE + argument container for use with rd_kafka_produce_va()\n\n See RD_KAFKA_V_..() macros below for which union field corresponds\n to which RD_KAFKA_VTYPE_..."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct rd_kafka_vu_s {
    #[doc = "< RD_KAFKA_VTYPE_.."]
    pub vtype: rd_kafka_vtype_t,
    pub u: rd_kafka_vu_s__bindgen_ty_1,
}
#[doc = " Value union, see RD_KAFKA_V_.. macros for which field to use."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union rd_kafka_vu_s__bindgen_ty_1 {
    pub cstr: *const ::std::os::raw::c_char,
    pub rkt: *mut rd_kafka_topic_t,
    pub i: ::std::os::raw::c_int,
    pub i32_: i32,
    pub i64_: i64,
    pub mem: rd_kafka_vu_s__bindgen_ty_1__bindgen_ty_1,
    pub header: rd_kafka_vu_s__bindgen_ty_1__bindgen_ty_2,
    pub headers: *mut rd_kafka_headers_t,
    pub ptr: *mut ::std::os::raw::c_void,
    #[doc = "< Padding size for future-proofness"]
    pub _pad: [::std::os::raw::c_char; 64usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rd_kafka_vu_s__bindgen_ty_1__bindgen_ty_1 {
    pub ptr: *mut ::std::os::raw::c_void,
    pub size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rd_kafka_vu_s__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<rd_kafka_vu_s__bindgen_ty_1__bindgen_ty_1>() - 16usize];
    ["Alignment of rd_kafka_vu_s__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<rd_kafka_vu_s__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: rd_kafka_vu_s__bindgen_ty_1__bindgen_ty_1::ptr"]
        [::std::mem::offset_of!(rd_kafka_vu_s__bindgen_ty_1__bindgen_ty_1, ptr) - 0usize];
    ["Offset of field: rd_kafka_vu_s__bindgen_ty_1__bindgen_ty_1::size"]
        [::std::mem::offset_of!(rd_kafka_vu_s__bindgen_ty_1__bindgen_ty_1, size) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rd_kafka_vu_s__bindgen_ty_1__bindgen_ty_2 {
    pub name: *const ::std::os::raw::c_char,
    pub val: *const ::std::os::raw::c_void,
    pub size: isize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rd_kafka_vu_s__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<rd_kafka_vu_s__bindgen_ty_1__bindgen_ty_2>() - 24usize];
    ["Alignment of rd_kafka_vu_s__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<rd_kafka_vu_s__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: rd_kafka_vu_s__bindgen_ty_1__bindgen_ty_2::name"]
        [::std::mem::offset_of!(rd_kafka_vu_s__bindgen_ty_1__bindgen_ty_2, name) - 0usize];
    ["Offset of field: rd_kafka_vu_s__bindgen_ty_1__bindgen_ty_2::val"]
        [::std::mem::offset_of!(rd_kafka_vu_s__bindgen_ty_1__bindgen_ty_2, val) - 8usize];
    ["Offset of field: rd_kafka_vu_s__bindgen_ty_1__bindgen_ty_2::size"]
        [::std::mem::offset_of!(rd_kafka_vu_s__bindgen_ty_1__bindgen_ty_2, size) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rd_kafka_vu_s__bindgen_ty_1"]
        [::std::mem::size_of::<rd_kafka_vu_s__bindgen_ty_1>() - 64usize];
    ["Alignment of rd_kafka_vu_s__bindgen_ty_1"]
        [::std::mem::align_of::<rd_kafka_vu_s__bindgen_ty_1>() - 8usize];
    ["Offset of field: rd_kafka_vu_s__bindgen_ty_1::cstr"]
        [::std::mem::offset_of!(rd_kafka_vu_s__bindgen_ty_1, cstr) - 0usize];
    ["Offset of field: rd_kafka_vu_s__bindgen_ty_1::rkt"]
        [::std::mem::offset_of!(rd_kafka_vu_s__bindgen_ty_1, rkt) - 0usize];
    ["Offset of field: rd_kafka_vu_s__bindgen_ty_1::i"]
        [::std::mem::offset_of!(rd_kafka_vu_s__bindgen_ty_1, i) - 0usize];
    ["Offset of field: rd_kafka_vu_s__bindgen_ty_1::i32_"]
        [::std::mem::offset_of!(rd_kafka_vu_s__bindgen_ty_1, i32_) - 0usize];
    ["Offset of field: rd_kafka_vu_s__bindgen_ty_1::i64_"]
        [::std::mem::offset_of!(rd_kafka_vu_s__bindgen_ty_1, i64_) - 0usize];
    ["Offset of field: rd_kafka_vu_s__bindgen_ty_1::mem"]
        [::std::mem::offset_of!(rd_kafka_vu_s__bindgen_ty_1, mem) - 0usize];
    ["Offset of field: rd_kafka_vu_s__bindgen_ty_1::header"]
        [::std::mem::offset_of!(rd_kafka_vu_s__bindgen_ty_1, header) - 0usize];
    ["Offset of field: rd_kafka_vu_s__bindgen_ty_1::headers"]
        [::std::mem::offset_of!(rd_kafka_vu_s__bindgen_ty_1, headers) - 0usize];
    ["Offset of field: rd_kafka_vu_s__bindgen_ty_1::ptr"]
        [::std::mem::offset_of!(rd_kafka_vu_s__bindgen_ty_1, ptr) - 0usize];
    ["Offset of field: rd_kafka_vu_s__bindgen_ty_1::_pad"]
        [::std::mem::offset_of!(rd_kafka_vu_s__bindgen_ty_1, _pad) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rd_kafka_vu_s"][::std::mem::size_of::<rd_kafka_vu_s>() - 72usize];
    ["Alignment of rd_kafka_vu_s"][::std::mem::align_of::<rd_kafka_vu_s>() - 8usize];
    ["Offset of field: rd_kafka_vu_s::vtype"]
        [::std::mem::offset_of!(rd_kafka_vu_s, vtype) - 0usize];
    ["Offset of field: rd_kafka_vu_s::u"][::std::mem::offset_of!(rd_kafka_vu_s, u) - 8usize];
};
#[doc = " @brief VTYPE + argument container for use with rd_kafka_produce_va()\n\n See RD_KAFKA_V_..() macros below for which union field corresponds\n to which RD_KAFKA_VTYPE_..."]
pub type rd_kafka_vu_t = rd_kafka_vu_s;
unsafe extern "C" {
    #[doc = " @brief Create a new headers list.\n\n @param initial_count Preallocate space for this number of headers.\n                      Any number of headers may be added, updated and\n                      removed regardless of the initial count."]
    pub fn rd_kafka_headers_new(initial_count: usize) -> *mut rd_kafka_headers_t;
}
unsafe extern "C" {
    #[doc = " @brief Destroy the headers list. The object and any returned value pointers\n        are not usable after this call."]
    pub fn rd_kafka_headers_destroy(hdrs: *mut rd_kafka_headers_t);
}
unsafe extern "C" {
    #[doc = " @brief Make a copy of headers list \\p src."]
    pub fn rd_kafka_headers_copy(src: *const rd_kafka_headers_t) -> *mut rd_kafka_headers_t;
}
unsafe extern "C" {
    #[doc = " @brief Add header with name \\p name and value \\p val (copied) of size\n        \\p size (not including null-terminator).\n\n @param hdrs       Headers list.\n @param name       Header name.\n @param name_size  Header name size (not including the null-terminator).\n                   If -1 the \\p name length is automatically acquired using\n                   strlen().\n @param value      Pointer to header value, or NULL (set size to 0 or -1).\n @param value_size Size of header value. If -1 the \\p value is assumed to be a\n                   null-terminated string and the length is automatically\n                   acquired using strlen().\n\n @returns RD_KAFKA_RESP_ERR__READ_ONLY if the headers are read-only,\n          else RD_KAFKA_RESP_ERR_NO_ERROR."]
    pub fn rd_kafka_header_add(
        hdrs: *mut rd_kafka_headers_t,
        name: *const ::std::os::raw::c_char,
        name_size: isize,
        value: *const ::std::os::raw::c_void,
        value_size: isize,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Remove all headers for the given key (if any).\n\n @returns RD_KAFKA_RESP_ERR__READ_ONLY if the headers are read-only,\n          RD_KAFKA_RESP_ERR__NOENT if no matching headers were found,\n          else RD_KAFKA_RESP_ERR_NO_ERROR if headers were removed."]
    pub fn rd_kafka_header_remove(
        hdrs: *mut rd_kafka_headers_t,
        name: *const ::std::os::raw::c_char,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Find last header in list \\p hdrs matching \\p name.\n\n @param hdrs   Headers list.\n @param name   Header to find (last match).\n @param valuep (out) Set to a (null-terminated) const pointer to the value\n               (may be NULL).\n @param sizep  (out) Set to the value's size (not including null-terminator).\n\n @returns RD_KAFKA_RESP_ERR_NO_ERROR if an entry was found, else\n          RD_KAFKA_RESP_ERR__NOENT.\n\n @remark The returned pointer in \\p valuep includes a trailing null-terminator\n         that is not accounted for in \\p sizep.\n @remark The returned pointer is only valid as long as the headers list and\n         the header item is valid."]
    pub fn rd_kafka_header_get_last(
        hdrs: *const rd_kafka_headers_t,
        name: *const ::std::os::raw::c_char,
        valuep: *mut *const ::std::os::raw::c_void,
        sizep: *mut usize,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Iterator for headers matching \\p name.\n\n        Same semantics as rd_kafka_header_get_last()\n\n @param hdrs   Headers to iterate.\n @param idx    Iterator index, start at 0 and increment by one for each call\n               as long as RD_KAFKA_RESP_ERR_NO_ERROR is returned.\n @param name   Header name to match.\n @param valuep (out) Set to a (null-terminated) const pointer to the value\n               (may be NULL).\n @param sizep  (out) Set to the value's size (not including null-terminator)."]
    pub fn rd_kafka_header_get(
        hdrs: *const rd_kafka_headers_t,
        idx: usize,
        name: *const ::std::os::raw::c_char,
        valuep: *mut *const ::std::os::raw::c_void,
        sizep: *mut usize,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Iterator for all headers.\n\n        Same semantics as rd_kafka_header_get()\n\n @sa rd_kafka_header_get()"]
    pub fn rd_kafka_header_get_all(
        hdrs: *const rd_kafka_headers_t,
        idx: usize,
        namep: *mut *const ::std::os::raw::c_char,
        valuep: *mut *const ::std::os::raw::c_void,
        sizep: *mut usize,
    ) -> rd_kafka_resp_err_t;
}
#[doc = " @brief A Kafka message as returned by the \\c rd_kafka_consume*() family\n        of functions as well as provided to the Producer \\c dr_msg_cb().\n\n For the consumer this object has two purposes:\n  - provide the application with a consumed message. (\\c err == 0)\n  - report per-topic+partition consumer errors (\\c err != 0)\n\n The application must check \\c err to decide what action to take.\n\n When the application is finished with a message it must call\n rd_kafka_message_destroy() unless otherwise noted."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rd_kafka_message_s {
    #[doc = "< Non-zero for error signaling."]
    pub err: rd_kafka_resp_err_t,
    #[doc = "< Topic"]
    pub rkt: *mut rd_kafka_topic_t,
    #[doc = "< Partition"]
    pub partition: i32,
    #[doc = "< Producer: original message payload.\n Consumer: Depends on the value of \\c err :\n - \\c err==0: Message payload.\n - \\c err!=0: Error string"]
    pub payload: *mut ::std::os::raw::c_void,
    #[doc = "< Depends on the value of \\c err :\n - \\c err==0: Message payload length\n - \\c err!=0: Error string length"]
    pub len: usize,
    #[doc = "< Depends on the value of \\c err :\n - \\c err==0: Optional message key"]
    pub key: *mut ::std::os::raw::c_void,
    #[doc = "< Depends on the value of \\c err :\n - \\c err==0: Optional message key length"]
    pub key_len: usize,
    #[doc = "< Consumer:\n - Message offset (or offset for error\n   if \\c err!=0 if applicable).\n   Producer, dr_msg_cb:\n   Message offset assigned by broker.\n   May be RD_KAFKA_OFFSET_INVALID\n   for retried messages when\n   idempotence is enabled."]
    pub offset: i64,
    #[doc = "< Consumer:\n  - rdkafka private pointer:\n    DO NOT MODIFY, DO NOT COPY.\n  Producer:\n  - dr_msg_cb:\n    msg_opaque from produce() call or\n    RD_KAFKA_V_OPAQUE from producev()."]
    pub _private: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rd_kafka_message_s"][::std::mem::size_of::<rd_kafka_message_s>() - 72usize];
    ["Alignment of rd_kafka_message_s"][::std::mem::align_of::<rd_kafka_message_s>() - 8usize];
    ["Offset of field: rd_kafka_message_s::err"]
        [::std::mem::offset_of!(rd_kafka_message_s, err) - 0usize];
    ["Offset of field: rd_kafka_message_s::rkt"]
        [::std::mem::offset_of!(rd_kafka_message_s, rkt) - 8usize];
    ["Offset of field: rd_kafka_message_s::partition"]
        [::std::mem::offset_of!(rd_kafka_message_s, partition) - 16usize];
    ["Offset of field: rd_kafka_message_s::payload"]
        [::std::mem::offset_of!(rd_kafka_message_s, payload) - 24usize];
    ["Offset of field: rd_kafka_message_s::len"]
        [::std::mem::offset_of!(rd_kafka_message_s, len) - 32usize];
    ["Offset of field: rd_kafka_message_s::key"]
        [::std::mem::offset_of!(rd_kafka_message_s, key) - 40usize];
    ["Offset of field: rd_kafka_message_s::key_len"]
        [::std::mem::offset_of!(rd_kafka_message_s, key_len) - 48usize];
    ["Offset of field: rd_kafka_message_s::offset"]
        [::std::mem::offset_of!(rd_kafka_message_s, offset) - 56usize];
    ["Offset of field: rd_kafka_message_s::_private"]
        [::std::mem::offset_of!(rd_kafka_message_s, _private) - 64usize];
};
#[doc = " @brief A Kafka message as returned by the \\c rd_kafka_consume*() family\n        of functions as well as provided to the Producer \\c dr_msg_cb().\n\n For the consumer this object has two purposes:\n  - provide the application with a consumed message. (\\c err == 0)\n  - report per-topic+partition consumer errors (\\c err != 0)\n\n The application must check \\c err to decide what action to take.\n\n When the application is finished with a message it must call\n rd_kafka_message_destroy() unless otherwise noted."]
pub type rd_kafka_message_t = rd_kafka_message_s;
unsafe extern "C" {
    #[doc = " @brief Frees resources for \\p rkmessage and hands ownership back to rdkafka."]
    pub fn rd_kafka_message_destroy(rkmessage: *mut rd_kafka_message_t);
}
unsafe extern "C" {
    #[doc = " @brief Returns the error string for an errored rd_kafka_message_t or NULL if\n        there was no error.\n\n @remark This function MUST NOT be used with the producer."]
    pub fn rd_kafka_message_errstr(
        rkmessage: *const rd_kafka_message_t,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " @brief Returns the error string for an errored produced rd_kafka_message_t or\n NULL if there was no error.\n\n @remark This function MUST used with the producer."]
    pub fn rd_kafka_message_produce_errstr(
        rkmessage: *const rd_kafka_message_t,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " @brief Returns the message timestamp for a consumed message.\n\n The timestamp is the number of milliseconds since the epoch (UTC).\n\n \\p tstype (if not NULL) is updated to indicate the type of timestamp.\n\n @returns message timestamp, or -1 if not available.\n\n @remark Message timestamps require broker version 0.10.0 or later."]
    pub fn rd_kafka_message_timestamp(
        rkmessage: *const rd_kafka_message_t,
        tstype: *mut rd_kafka_timestamp_type_t,
    ) -> i64;
}
unsafe extern "C" {
    #[doc = " @brief Returns the latency for a produced message measured from\n        the produce() call.\n\n @returns the latency in microseconds, or -1 if not available."]
    pub fn rd_kafka_message_latency(rkmessage: *const rd_kafka_message_t) -> i64;
}
unsafe extern "C" {
    #[doc = " @brief Returns the broker id of the broker the message was produced to\n        or fetched from.\n\n @returns a broker id if known, else -1."]
    pub fn rd_kafka_message_broker_id(rkmessage: *const rd_kafka_message_t) -> i32;
}
unsafe extern "C" {
    #[doc = " @brief Get the message header list.\n\n The returned pointer in \\p *hdrsp is associated with the \\p rkmessage and\n must not be used after destruction of the message object or the header\n list is replaced with rd_kafka_message_set_headers().\n\n @returns RD_KAFKA_RESP_ERR_NO_ERROR if headers were returned,\n          RD_KAFKA_RESP_ERR__NOENT if the message has no headers,\n          or another error code if the headers could not be parsed.\n\n @remark Headers require broker version 0.11.0.0 or later.\n\n @remark As an optimization the raw protocol headers are parsed on\n         the first call to this function."]
    pub fn rd_kafka_message_headers(
        rkmessage: *const rd_kafka_message_t,
        hdrsp: *mut *mut rd_kafka_headers_t,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Get the message header list and detach the list from the message\n        making the application the owner of the headers.\n        The application must eventually destroy the headers using\n        rd_kafka_headers_destroy().\n        The message's headers will be set to NULL.\n\n        Otherwise same semantics as rd_kafka_message_headers()\n\n @sa rd_kafka_message_headers"]
    pub fn rd_kafka_message_detach_headers(
        rkmessage: *mut rd_kafka_message_t,
        hdrsp: *mut *mut rd_kafka_headers_t,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Replace the message's current headers with a new list.\n\n @param rkmessage The message to set headers.\n @param hdrs New header list. The message object assumes ownership of\n             the list, the list will be destroyed automatically with\n             the message object.\n             The new headers list may be updated until the message object\n             is passed or returned to librdkafka.\n\n @remark The existing headers object, if any, will be destroyed."]
    pub fn rd_kafka_message_set_headers(
        rkmessage: *mut rd_kafka_message_t,
        hdrs: *mut rd_kafka_headers_t,
    );
}
unsafe extern "C" {
    #[doc = " @brief Returns the number of header key/value pairs\n\n @param hdrs   Headers to count"]
    pub fn rd_kafka_header_cnt(hdrs: *const rd_kafka_headers_t) -> usize;
}
#[repr(u32)]
#[doc = " @enum rd_kafka_msg_status_t\n @brief Message persistence status can be used by the application to\n        find out if a produced message was persisted in the topic log."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum rd_kafka_msg_status_t {
    #[doc = " Message was never transmitted to the broker, or failed with\n  an error indicating it was not written to the log.\n  Application retry risks ordering, but not duplication."]
    RD_KAFKA_MSG_STATUS_NOT_PERSISTED = 0,
    #[doc = " Message was transmitted to broker, but no acknowledgement was\n  received.\n  Application retry risks ordering and duplication."]
    RD_KAFKA_MSG_STATUS_POSSIBLY_PERSISTED = 1,
    #[doc = " Message was written to the log and acknowledged by the broker.\n  No reason for application to retry.\n  Note: this value should only be trusted with \\c acks=all."]
    RD_KAFKA_MSG_STATUS_PERSISTED = 2,
}
unsafe extern "C" {
    #[doc = " @brief Returns the message's persistence status in the topic log.\n\n @remark The message status is not available in on_acknowledgement\n         interceptors."]
    pub fn rd_kafka_message_status(rkmessage: *const rd_kafka_message_t) -> rd_kafka_msg_status_t;
}
unsafe extern "C" {
    #[doc = " @returns the message's partition leader epoch at the time the message was\n          fetched and if known, else -1.\n\n @remark This API must only be used on consumed messages without error.\n @remark Requires broker version >= 2.10 (KIP-320)."]
    pub fn rd_kafka_message_leader_epoch(rkmessage: *const rd_kafka_message_t) -> i32;
}
unsafe extern "C" {
    #[doc = " @brief Computes base64 encoding for the given uuid string.\n @param uuid UUID for which base64 encoding is required.\n\n @return base64 encoded string for the given UUID or NULL in case of some\n         issue with the conversion or the conversion is not supported."]
    pub fn rd_kafka_Uuid_base64str(uuid: *const rd_kafka_Uuid_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " @brief Gets least significant 64 bits for the given UUID.\n\n @param uuid UUID\n\n @return least significant 64 bits for the given UUID."]
    pub fn rd_kafka_Uuid_least_significant_bits(uuid: *const rd_kafka_Uuid_t) -> i64;
}
unsafe extern "C" {
    #[doc = " @brief Gets most significant 64 bits for the given UUID.\n\n @param uuid UUID\n\n @return most significant 64 bits for the given UUID."]
    pub fn rd_kafka_Uuid_most_significant_bits(uuid: *const rd_kafka_Uuid_t) -> i64;
}
unsafe extern "C" {
    #[doc = " @brief Creates a new UUID.\n\n @param most_significant_bits most significant 64 bits of the 128 bits UUID.\n @param least_significant_bits least significant 64 bits of the 128 bits UUID.\n\n @return A newly allocated UUID.\n @remark Must be freed after use using rd_kafka_Uuid_destroy()"]
    pub fn rd_kafka_Uuid_new(
        most_significant_bits: i64,
        least_significant_bits: i64,
    ) -> *mut rd_kafka_Uuid_t;
}
unsafe extern "C" {
    #[doc = " @brief Copies the given UUID.\n\n @param uuid UUID to be copied.\n\n @return A newly allocated copy of the provided UUID.\n @remark Must be freed after use using rd_kafka_Uuid_destroy()"]
    pub fn rd_kafka_Uuid_copy(uuid: *const rd_kafka_Uuid_t) -> *mut rd_kafka_Uuid_t;
}
unsafe extern "C" {
    #[doc = " @brief Destroy the provided uuid.\n\n @param uuid UUID"]
    pub fn rd_kafka_Uuid_destroy(uuid: *mut rd_kafka_Uuid_t);
}
#[repr(i32)]
#[doc = " @enum rd_kafka_conf_res_t\n @brief Configuration result type"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq, :: num_enum :: TryFromPrimitive)]
pub enum rd_kafka_conf_res_t {
    #[doc = "< Unknown configuration name."]
    RD_KAFKA_CONF_UNKNOWN = -2,
    #[doc = "< Invalid configuration value or\n   property or value not supported in\n   this build."]
    RD_KAFKA_CONF_INVALID = -1,
    #[doc = "< Configuration okay"]
    RD_KAFKA_CONF_OK = 0,
}
unsafe extern "C" {
    #[doc = " @brief Create configuration object.\n\n When providing your own configuration to the \\c rd_kafka_*_new_*() calls\n the rd_kafka_conf_t objects needs to be created with this function\n which will set up the defaults.\n I.e.:\n @code\n   rd_kafka_conf_t *myconf;\n   rd_kafka_conf_res_t res;\n\n   myconf = rd_kafka_conf_new();\n   res = rd_kafka_conf_set(myconf, \"socket.timeout.ms\", \"600\",\n                           errstr, sizeof(errstr));\n   if (res != RD_KAFKA_CONF_OK)\n      die(\"%s\\n\", errstr);\n\n   rk = rd_kafka_new(..., myconf);\n @endcode\n\n Please see CONFIGURATION.md for the default settings or use\n rd_kafka_conf_properties_show() to provide the information at runtime.\n\n The properties are identical to the Apache Kafka configuration properties\n whenever possible.\n\n @remark A successful call to rd_kafka_new() will assume ownership of\n the conf object and rd_kafka_conf_destroy() must not be called.\n\n @returns A new rd_kafka_conf_t object with defaults set.\n\n @sa rd_kafka_new(), rd_kafka_conf_set(), rd_kafka_conf_destroy()"]
    pub fn rd_kafka_conf_new() -> *mut rd_kafka_conf_t;
}
unsafe extern "C" {
    #[doc = " @brief Destroys a conf object."]
    pub fn rd_kafka_conf_destroy(conf: *mut rd_kafka_conf_t);
}
unsafe extern "C" {
    #[doc = " @brief Creates a copy/duplicate of configuration object \\p conf\n\n @remark Interceptors are NOT copied to the new configuration object.\n @sa rd_kafka_interceptor_f_on_conf_dup"]
    pub fn rd_kafka_conf_dup(conf: *const rd_kafka_conf_t) -> *mut rd_kafka_conf_t;
}
unsafe extern "C" {
    #[doc = " @brief Same as rd_kafka_conf_dup() but with an array of property name\n        prefixes to filter out (ignore) when copying."]
    pub fn rd_kafka_conf_dup_filter(
        conf: *const rd_kafka_conf_t,
        filter_cnt: usize,
        filter: *mut *const ::std::os::raw::c_char,
    ) -> *mut rd_kafka_conf_t;
}
unsafe extern "C" {
    #[doc = " @returns the configuration object used by an rd_kafka_t instance.\n          For use with rd_kafka_conf_get(), et.al., to extract configuration\n          properties from a running client.\n\n @remark the returned object is read-only and its lifetime is the same\n         as the rd_kafka_t object."]
    pub fn rd_kafka_conf(rk: *mut rd_kafka_t) -> *const rd_kafka_conf_t;
}
unsafe extern "C" {
    #[doc = " @brief Sets a configuration property.\n\n \\p conf must have been previously created with rd_kafka_conf_new().\n\n Fallthrough:\n Topic-level configuration properties may be set using this interface\n in which case they are applied on the \\c default_topic_conf.\n If no \\c default_topic_conf has been set one will be created.\n Any subsequent rd_kafka_conf_set_default_topic_conf() calls will\n replace the current default topic configuration.\n\n @returns \\c rd_kafka_conf_res_t to indicate success or failure.\n In case of failure \\p errstr is updated to contain a human readable\n error string.\n\n @remark Setting properties or values that were disabled at build time due to\n         missing dependencies will return RD_KAFKA_CONF_INVALID."]
    pub fn rd_kafka_conf_set(
        conf: *mut rd_kafka_conf_t,
        name: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
        errstr: *mut ::std::os::raw::c_char,
        errstr_size: usize,
    ) -> rd_kafka_conf_res_t;
}
unsafe extern "C" {
    #[doc = " @brief Enable event sourcing.\n \\p events is a bitmask of \\c RD_KAFKA_EVENT_* of events to enable\n for consumption by `rd_kafka_queue_poll()`."]
    pub fn rd_kafka_conf_set_events(conf: *mut rd_kafka_conf_t, events: ::std::os::raw::c_int);
}
unsafe extern "C" {
    #[doc = " @brief Generic event callback to be used with the event API to trigger\n        callbacks for \\c rd_kafka_event_t objects from a background\n        thread serving the background queue.\n\n How to use:\n  1. First set the event callback on the configuration object with this\n     function, followed by creating an rd_kafka_t instance\n     with rd_kafka_new().\n  2. Get the instance's background queue with rd_kafka_queue_get_background()\n     and pass it as the reply/response queue to an API that takes an\n     event queue, such as rd_kafka_CreateTopics().\n  3. As the response event is ready and enqueued on the background queue the\n     event callback will be triggered from the background thread.\n  4. Prior to destroying the client instance, loose your reference to the\n     background queue by calling rd_kafka_queue_destroy().\n\n The application must destroy the \\c rkev passed to \\p event cb using\n rd_kafka_event_destroy().\n\n The \\p event_cb \\c opaque argument is the opaque set with\n rd_kafka_conf_set_opaque().\n\n @remark This callback is a specialized alternative to the poll-based\n         event API described in the Event interface section.\n\n @remark The \\p event_cb will be called spontaneously from a background\n         thread completely managed by librdkafka.\n         Take care to perform proper locking of application objects.\n\n @warning The application MUST NOT call rd_kafka_destroy() from the\n          event callback.\n\n @sa rd_kafka_queue_get_background"]
    pub fn rd_kafka_conf_set_background_event_cb(
        conf: *mut rd_kafka_conf_t,
        event_cb: ::std::option::Option<
            unsafe extern "C" fn(
                rk: *mut rd_kafka_t,
                rkev: *mut rd_kafka_event_t,
                opaque: *mut ::std::os::raw::c_void,
            ),
        >,
    );
}
unsafe extern "C" {
    #[doc = " @deprecated See rd_kafka_conf_set_dr_msg_cb()"]
    pub fn rd_kafka_conf_set_dr_cb(
        conf: *mut rd_kafka_conf_t,
        dr_cb: ::std::option::Option<
            unsafe extern "C" fn(
                rk: *mut rd_kafka_t,
                payload: *mut ::std::os::raw::c_void,
                len: usize,
                err: rd_kafka_resp_err_t,
                opaque: *mut ::std::os::raw::c_void,
                msg_opaque: *mut ::std::os::raw::c_void,
            ),
        >,
    );
}
unsafe extern "C" {
    #[doc = " @brief \\b Producer: Set delivery report callback in provided \\p conf object.\n\n The delivery report callback will be called once for each message\n accepted by rd_kafka_produce() (et.al) with \\p err set to indicate\n the result of the produce request.\n\n The callback is called when a message is succesfully produced or\n if librdkafka encountered a permanent failure.\n Delivery errors occur when the retry count is exceeded, when the\n message.timeout.ms timeout is exceeded or there is a permanent error\n like RD_KAFKA_RESP_ERR_UNKNOWN_TOPIC_OR_PART.\n\n An application must call rd_kafka_poll() at regular intervals to\n serve queued delivery report callbacks.\n\n The broker-assigned offset can be retrieved with \\c rkmessage->offset\n and the timestamp can be retrieved using rd_kafka_message_timestamp().\n\n The \\p dr_msg_cb \\c opaque argument is the opaque set with\n rd_kafka_conf_set_opaque().\n The per-message msg_opaque value is available in\n \\c rd_kafka_message_t._private.\n\n @remark The Idempotent Producer may return invalid timestamp\n         (RD_KAFKA_TIMESTAMP_NOT_AVAILABLE), and\n         and offset (RD_KAFKA_OFFSET_INVALID) for retried messages\n         that were previously successfully delivered but not properly\n         acknowledged."]
    pub fn rd_kafka_conf_set_dr_msg_cb(
        conf: *mut rd_kafka_conf_t,
        dr_msg_cb: ::std::option::Option<
            unsafe extern "C" fn(
                rk: *mut rd_kafka_t,
                rkmessage: *const rd_kafka_message_t,
                opaque: *mut ::std::os::raw::c_void,
            ),
        >,
    );
}
unsafe extern "C" {
    #[doc = " @brief \\b Consumer: Set consume callback for use with\n        rd_kafka_consumer_poll()\n\n The \\p consume_cb \\p opaque argument is the opaque set with\n rd_kafka_conf_set_opaque()."]
    pub fn rd_kafka_conf_set_consume_cb(
        conf: *mut rd_kafka_conf_t,
        consume_cb: ::std::option::Option<
            unsafe extern "C" fn(
                rkmessage: *mut rd_kafka_message_t,
                opaque: *mut ::std::os::raw::c_void,
            ),
        >,
    );
}
unsafe extern "C" {
    #[doc = " @brief \\b Consumer: Set rebalance callback for use with\n                     coordinated consumer group balancing.\n\n The \\p err field is set to either RD_KAFKA_RESP_ERR__ASSIGN_PARTITIONS\n or RD_KAFKA_RESP_ERR__REVOKE_PARTITIONS and 'partitions'\n contains the full partition set that was either assigned or revoked.\n\n Registering a \\p rebalance_cb turns off librdkafka's automatic\n partition assignment/revocation and instead delegates that responsibility\n to the application's \\p rebalance_cb.\n\n The rebalance callback is responsible for updating librdkafka's\n assignment set based on the two events: RD_KAFKA_RESP_ERR__ASSIGN_PARTITIONS\n and RD_KAFKA_RESP_ERR__REVOKE_PARTITIONS but should also be able to handle\n arbitrary rebalancing failures where \\p err is neither of those.\n @remark In this latter case (arbitrary error), the application must\n         call rd_kafka_assign(rk, NULL) to synchronize state.\n\n For eager/non-cooperative `partition.assignment.strategy` assignors,\n such as `range` and `roundrobin`, the application must use\n rd_kafka_assign() to set or clear the entire assignment.\n For the cooperative assignors, such as `cooperative-sticky`, the application\n must use rd_kafka_incremental_assign() for\n RD_KAFKA_RESP_ERR__ASSIGN_PARTITIONS and rd_kafka_incremental_unassign()\n for RD_KAFKA_RESP_ERR__REVOKE_PARTITIONS.\n\n Without a rebalance callback this is done automatically by librdkafka\n but registering a rebalance callback gives the application flexibility\n in performing other operations along with the assigning/revocation,\n such as fetching offsets from an alternate location (on assign)\n or manually committing offsets (on revoke).\n\n rebalance_cb is always triggered exactly once when a rebalance completes\n with a new assignment, even if that assignment is empty. If an\n eager/non-cooperative assignor is configured, there will eventually be\n exactly one corresponding call to rebalance_cb to revoke these partitions\n (even if empty), whether this is due to a group rebalance or lost\n partitions. In the cooperative case, rebalance_cb will never be called if\n the set of partitions being revoked is empty (whether or not lost).\n\n The callback's \\p opaque argument is the opaque set with\n rd_kafka_conf_set_opaque().\n\n @remark The \\p partitions list is destroyed by librdkafka on return\n         return from the rebalance_cb and must not be freed or\n         saved by the application.\n\n @remark Be careful when modifying the \\p partitions list.\n         Changing this list should only be done to change the initial\n         offsets for each partition.\n         But a function like `rd_kafka_position()` might have unexpected\n         effects for instance when a consumer gets assigned a partition\n         it used to consume at an earlier rebalance. In this case, the\n         list of partitions will be updated with the old offset for that\n         partition. In this case, it is generally better to pass a copy\n         of the list (see `rd_kafka_topic_partition_list_copy()`).\n         The result of `rd_kafka_position()` is typically outdated in\n         RD_KAFKA_RESP_ERR__ASSIGN_PARTITIONS.\n\n @sa rd_kafka_assign()\n @sa rd_kafka_incremental_assign()\n @sa rd_kafka_incremental_unassign()\n @sa rd_kafka_assignment_lost()\n @sa rd_kafka_rebalance_protocol()\n\n The following example shows the application's responsibilities:\n @code\n    static void rebalance_cb (rd_kafka_t *rk, rd_kafka_resp_err_t err,\n                              rd_kafka_topic_partition_list_t *partitions,\n                              void *opaque) {\n\n        switch (err)\n        {\n          case RD_KAFKA_RESP_ERR__ASSIGN_PARTITIONS:\n             // application may load offets from arbitrary external\n             // storage here and update \\p partitions\n             if (!strcmp(rd_kafka_rebalance_protocol(rk), \"COOPERATIVE\"))\n                     rd_kafka_incremental_assign(rk, partitions);\n             else // EAGER\n                     rd_kafka_assign(rk, partitions);\n             break;\n\n          case RD_KAFKA_RESP_ERR__REVOKE_PARTITIONS:\n             if (manual_commits) // Optional explicit manual commit\n                 rd_kafka_commit(rk, partitions, 0); // sync commit\n\n             if (!strcmp(rd_kafka_rebalance_protocol(rk), \"COOPERATIVE\"))\n                     rd_kafka_incremental_unassign(rk, partitions);\n             else // EAGER\n                     rd_kafka_assign(rk, NULL);\n             break;\n\n          default:\n             handle_unlikely_error(err);\n             rd_kafka_assign(rk, NULL); // sync state\n             break;\n         }\n    }\n @endcode\n\n @remark The above example lacks error handling for assign calls, see\n         the examples/ directory."]
    pub fn rd_kafka_conf_set_rebalance_cb(
        conf: *mut rd_kafka_conf_t,
        rebalance_cb: ::std::option::Option<
            unsafe extern "C" fn(
                rk: *mut rd_kafka_t,
                err: rd_kafka_resp_err_t,
                partitions: *mut rd_kafka_topic_partition_list_t,
                opaque: *mut ::std::os::raw::c_void,
            ),
        >,
    );
}
unsafe extern "C" {
    #[doc = " @brief \\b Consumer: Set offset commit callback for use with consumer groups.\n\n The results of automatic or manual offset commits will be scheduled\n for this callback and is served by rd_kafka_consumer_poll().\n\n If no partitions had valid offsets to commit this callback will be called\n with \\p err == RD_KAFKA_RESP_ERR__NO_OFFSET which is not to be considered\n an error.\n\n The \\p offsets list contains per-partition information:\n   - \\c offset: committed offset (attempted)\n   - \\c err:    commit error\n\n The callback's \\p opaque argument is the opaque set with\n rd_kafka_conf_set_opaque()."]
    pub fn rd_kafka_conf_set_offset_commit_cb(
        conf: *mut rd_kafka_conf_t,
        offset_commit_cb: ::std::option::Option<
            unsafe extern "C" fn(
                rk: *mut rd_kafka_t,
                err: rd_kafka_resp_err_t,
                offsets: *mut rd_kafka_topic_partition_list_t,
                opaque: *mut ::std::os::raw::c_void,
            ),
        >,
    );
}
unsafe extern "C" {
    #[doc = " @brief Set error callback in provided conf object.\n\n The error callback is used by librdkafka to signal warnings and errors\n back to the application.\n\n These errors should generally be considered informational and non-permanent,\n the client will try to recover automatically from all type of errors.\n Given that the client and cluster configuration is correct the\n application should treat these as temporary errors.\n\n \\p error_cb will be triggered with \\c err set to RD_KAFKA_RESP_ERR__FATAL\n if a fatal error has been raised; in this case use rd_kafka_fatal_error() to\n retrieve the fatal error code and error string, and then begin terminating\n the client instance.\n\n If no \\p error_cb is registered, or RD_KAFKA_EVENT_ERROR has not been set\n with rd_kafka_conf_set_events, then the errors will be logged instead.\n\n The callback's \\p opaque argument is the opaque set with\n rd_kafka_conf_set_opaque()."]
    pub fn rd_kafka_conf_set_error_cb(
        conf: *mut rd_kafka_conf_t,
        error_cb: ::std::option::Option<
            unsafe extern "C" fn(
                rk: *mut rd_kafka_t,
                err: ::std::os::raw::c_int,
                reason: *const ::std::os::raw::c_char,
                opaque: *mut ::std::os::raw::c_void,
            ),
        >,
    );
}
unsafe extern "C" {
    #[doc = " @brief Set throttle callback.\n\n The throttle callback is used to forward broker throttle times to the\n application for Produce and Fetch (consume) requests.\n\n Callbacks are triggered whenever a non-zero throttle time is returned by\n the broker, or when the throttle time drops back to zero.\n\n An application must call rd_kafka_poll() or rd_kafka_consumer_poll() at\n regular intervals to serve queued callbacks.\n\n The callback's \\p opaque argument is the opaque set with\n rd_kafka_conf_set_opaque().\n\n @remark Requires broker version 0.9.0 or later."]
    pub fn rd_kafka_conf_set_throttle_cb(
        conf: *mut rd_kafka_conf_t,
        throttle_cb: ::std::option::Option<
            unsafe extern "C" fn(
                rk: *mut rd_kafka_t,
                broker_name: *const ::std::os::raw::c_char,
                broker_id: i32,
                throttle_time_ms: ::std::os::raw::c_int,
                opaque: *mut ::std::os::raw::c_void,
            ),
        >,
    );
}
unsafe extern "C" {
    #[doc = " @brief Set logger callback.\n\n The default is to print to stderr, but a syslog logger is also available,\n see rd_kafka_log_print and rd_kafka_log_syslog for the builtin alternatives.\n Alternatively the application may provide its own logger callback.\n Or pass \\p func as NULL to disable logging.\n\n This is the configuration alternative to the deprecated rd_kafka_set_logger()\n\n @remark The log_cb will be called spontaneously from librdkafka's internal\n         threads unless logs have been forwarded to a poll queue through\n         \\c rd_kafka_set_log_queue().\n         An application MUST NOT call any librdkafka APIs or do any prolonged\n         work in a non-forwarded \\c log_cb."]
    pub fn rd_kafka_conf_set_log_cb(
        conf: *mut rd_kafka_conf_t,
        log_cb: ::std::option::Option<
            unsafe extern "C" fn(
                rk: *const rd_kafka_t,
                level: ::std::os::raw::c_int,
                fac: *const ::std::os::raw::c_char,
                buf: *const ::std::os::raw::c_char,
            ),
        >,
    );
}
unsafe extern "C" {
    #[doc = " @brief Set statistics callback in provided conf object.\n\n The statistics callback is triggered from rd_kafka_poll() every\n \\c statistics.interval.ms (needs to be configured separately).\n Function arguments:\n   - \\p rk - Kafka handle\n   - \\p json - String containing the statistics data in JSON format\n   - \\p json_len - Length of \\p json string.\n   - \\p opaque - Application-provided opaque as set by\n                 rd_kafka_conf_set_opaque().\n\n For more information on the format of \\p json, see\n https://github.com/confluentinc/librdkafka/wiki/Statistics\n\n If the application wishes to hold on to the \\p json pointer and free\n it at a later time it must return 1 from the \\p stats_cb.\n If the application returns 0 from the \\p stats_cb then librdkafka\n will immediately free the \\p json pointer.\n\n See STATISTICS.md for a full definition of the JSON object."]
    pub fn rd_kafka_conf_set_stats_cb(
        conf: *mut rd_kafka_conf_t,
        stats_cb: ::std::option::Option<
            unsafe extern "C" fn(
                rk: *mut rd_kafka_t,
                json: *mut ::std::os::raw::c_char,
                json_len: usize,
                opaque: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    #[doc = " @brief Set SASL/OAUTHBEARER token refresh callback in provided conf object.\n\n @param conf the configuration to mutate.\n @param oauthbearer_token_refresh_cb the callback to set; callback function\n  arguments:<br>\n   \\p rk - Kafka handle<br>\n   \\p oauthbearer_config - Value of configuration property\n                           sasl.oauthbearer.config.\n   \\p opaque - Application-provided opaque set via\n               rd_kafka_conf_set_opaque()\n\n The SASL/OAUTHBEARER token refresh callback is triggered via rd_kafka_poll()\n whenever OAUTHBEARER is the SASL mechanism and a token needs to be retrieved,\n typically based on the configuration defined in \\c sasl.oauthbearer.config.\n\n The callback should invoke rd_kafka_oauthbearer_set_token()\n or rd_kafka_oauthbearer_set_token_failure() to indicate success\n or failure, respectively.\n\n The refresh operation is eventable and may be received via\n rd_kafka_queue_poll() with an event type of\n \\c RD_KAFKA_EVENT_OAUTHBEARER_TOKEN_REFRESH.\n\n Note that before any SASL/OAUTHBEARER broker connection can succeed the\n application must call rd_kafka_oauthbearer_set_token() once -- either\n directly or, more typically, by invoking either rd_kafka_poll(),\n rd_kafka_consumer_poll(), rd_kafka_queue_poll(), etc, in order to cause\n retrieval of an initial token to occur.\n\n Alternatively, the application can enable the SASL queue by calling\n rd_kafka_conf_enable_sasl_queue() on the configuration object prior to\n creating the client instance, get the SASL queue with\n rd_kafka_queue_get_sasl(), and either serve the queue manually by calling\n rd_kafka_queue_poll(), or redirecting the queue to the background thread to\n have the queue served automatically. For the latter case the SASL queue\n must be forwarded to the background queue with rd_kafka_queue_forward().\n A convenience function is available to automatically forward the SASL queue\n to librdkafka's background thread, see\n rd_kafka_sasl_background_callbacks_enable().\n\n An unsecured JWT refresh handler is provided by librdkafka for development\n and testing purposes, it is enabled by setting\n the \\c enable.sasl.oauthbearer.unsecure.jwt property to true and is\n mutually exclusive to using a refresh callback.\n\n @sa rd_kafka_sasl_background_callbacks_enable()\n @sa rd_kafka_queue_get_sasl()"]
    pub fn rd_kafka_conf_set_oauthbearer_token_refresh_cb(
        conf: *mut rd_kafka_conf_t,
        oauthbearer_token_refresh_cb: ::std::option::Option<
            unsafe extern "C" fn(
                rk: *mut rd_kafka_t,
                oauthbearer_config: *const ::std::os::raw::c_char,
                opaque: *mut ::std::os::raw::c_void,
            ),
        >,
    );
}
unsafe extern "C" {
    #[doc = " @brief Enable/disable creation of a queue specific to SASL events\n        and callbacks.\n\n For SASL mechanisms that trigger callbacks (currently OAUTHBEARER) this\n configuration API allows an application to get a dedicated\n queue for the SASL events/callbacks. After enabling the queue with this API\n the application can retrieve the queue by calling\n rd_kafka_queue_get_sasl() on the client instance.\n This queue may then be served directly by the application\n (with rd_kafka_queue_poll(), et.al)  or forwarded to another queue, such as\n the background queue.\n\n A convenience function is available to automatically forward the SASL queue\n to librdkafka's background thread, see\n rd_kafka_sasl_background_callbacks_enable().\n\n By default (\\p enable = 0) the main queue (as served by rd_kafka_poll(),\n et.al.) is used for SASL callbacks.\n\n @remark The SASL queue is currently only used by the SASL OAUTHBEARER\n         mechanism's token_refresh_cb().\n\n @sa rd_kafka_queue_get_sasl()\n @sa rd_kafka_sasl_background_callbacks_enable()"]
    pub fn rd_kafka_conf_enable_sasl_queue(
        conf: *mut rd_kafka_conf_t,
        enable: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    #[doc = " @brief Set socket callback.\n\n The socket callback is responsible for opening a socket\n according to the supplied \\p domain, \\p type and \\p protocol.\n The socket shall be created with \\c CLOEXEC set in a racefree fashion, if\n possible.\n\n The callback's \\p opaque argument is the opaque set with\n rd_kafka_conf_set_opaque().\n\n Default:\n  - on linux: racefree CLOEXEC\n  - others  : non-racefree CLOEXEC\n\n @remark The callback will be called from an internal librdkafka thread."]
    pub fn rd_kafka_conf_set_socket_cb(
        conf: *mut rd_kafka_conf_t,
        socket_cb: ::std::option::Option<
            unsafe extern "C" fn(
                domain: ::std::os::raw::c_int,
                type_: ::std::os::raw::c_int,
                protocol: ::std::os::raw::c_int,
                opaque: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    #[doc = " @brief Set connect callback.\n\n The connect callback is responsible for connecting socket \\p sockfd\n to peer address \\p addr.\n The \\p id field contains the broker identifier.\n\n \\p connect_cb shall return 0 on success (socket connected) or an error\n number (errno) on error.\n\n The callback's \\p opaque argument is the opaque set with\n rd_kafka_conf_set_opaque().\n\n @remark The callback will be called from an internal librdkafka thread."]
    pub fn rd_kafka_conf_set_connect_cb(
        conf: *mut rd_kafka_conf_t,
        connect_cb: ::std::option::Option<
            unsafe extern "C" fn(
                sockfd: ::std::os::raw::c_int,
                addr: *const sockaddr,
                addrlen: ::std::os::raw::c_int,
                id: *const ::std::os::raw::c_char,
                opaque: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    #[doc = " @brief Set close socket callback.\n\n Close a socket (optionally opened with socket_cb()).\n\n The callback's \\p opaque argument is the opaque set with\n rd_kafka_conf_set_opaque().\n\n @remark The callback will be called from an internal librdkafka thread."]
    pub fn rd_kafka_conf_set_closesocket_cb(
        conf: *mut rd_kafka_conf_t,
        closesocket_cb: ::std::option::Option<
            unsafe extern "C" fn(
                sockfd: ::std::os::raw::c_int,
                opaque: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    #[doc = " @brief Set open callback.\n\n The open callback is responsible for opening the file specified by\n pathname, flags and mode.\n The file shall be opened with \\c CLOEXEC set in a racefree fashion, if\n possible.\n\n Default:\n  - on linux: racefree CLOEXEC\n  - others  : non-racefree CLOEXEC\n\n The callback's \\p opaque argument is the opaque set with\n rd_kafka_conf_set_opaque().\n\n @remark The callback will be called from an internal librdkafka thread."]
    #[cfg(unix)]
    pub fn rd_kafka_conf_set_open_cb(
        conf: *mut rd_kafka_conf_t,
        open_cb: ::std::option::Option<
            unsafe extern "C" fn(
                pathname: *const ::std::os::raw::c_char,
                flags: ::std::os::raw::c_int,
                mode: mode_t,
                opaque: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    #[doc = " @brief Set address resolution callback.\n\n The callback is responsible for resolving the hostname \\p node and the\n service \\p service into a list of socket addresses as \\c getaddrinfo(3)\n would. The \\p hints and \\p res parameters function as they do for\n \\c getaddrinfo(3). The callback's \\p opaque argument is the opaque set with\n rd_kafka_conf_set_opaque().\n\n If the callback is invoked with a NULL \\p node, \\p service, and \\p hints, the\n callback should instead free the addrinfo struct specified in \\p res. In this\n case the callback must succeed; the return value will not be checked by the\n caller.\n\n The callback's return value is interpreted as the return value of \\p\n \\c getaddrinfo(3).\n\n @remark The callback will be called from an internal librdkafka thread."]
    pub fn rd_kafka_conf_set_resolve_cb(
        conf: *mut rd_kafka_conf_t,
        resolve_cb: ::std::option::Option<
            unsafe extern "C" fn(
                node: *const ::std::os::raw::c_char,
                service: *const ::std::os::raw::c_char,
                hints: *const addrinfo,
                res: *mut *mut addrinfo,
                opaque: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    #[doc = " @brief Sets the verification callback of the broker certificate\n\n The verification callback is triggered from internal librdkafka threads\n upon connecting to a broker. On each connection attempt the callback\n will be called for each certificate in the broker's certificate chain,\n starting at the root certification, as long as the application callback\n returns 1 (valid certificate).\n \\c broker_name and \\c broker_id correspond to the broker the connection\n is being made to.\n The \\c x509_error argument indicates if OpenSSL's verification of\n the certificate succeed (0) or failed (an OpenSSL error code).\n The application may set the SSL context error code by returning 0\n from the verify callback and providing a non-zero SSL context error code\n in \\c x509_error.\n If the verify callback sets \\c x509_error to 0, returns 1, and the\n original \\c x509_error was non-zero, the error on the SSL context will\n be cleared.\n \\c x509_error is always a valid pointer to an int.\n\n \\c depth is the depth of the current certificate in the chain, starting\n at the root certificate.\n\n The certificate itself is passed in binary DER format in \\c buf of\n size \\c size.\n\n The callback must return 1 if verification succeeds, or\n 0 if verification fails and then write a human-readable error message\n to \\c errstr (limited to \\c errstr_size bytes, including nul-term).\n\n The callback's \\p opaque argument is the opaque set with\n rd_kafka_conf_set_opaque().\n\n @returns RD_KAFKA_CONF_OK if SSL is supported in this build, else\n          RD_KAFKA_CONF_INVALID.\n\n @warning This callback will be called from internal librdkafka threads.\n\n @remark See <openssl/x509_vfy.h> in the OpenSSL source distribution\n         for a list of \\p x509_error codes."]
    pub fn rd_kafka_conf_set_ssl_cert_verify_cb(
        conf: *mut rd_kafka_conf_t,
        ssl_cert_verify_cb: ::std::option::Option<
            unsafe extern "C" fn(
                rk: *mut rd_kafka_t,
                broker_name: *const ::std::os::raw::c_char,
                broker_id: i32,
                x509_error: *mut ::std::os::raw::c_int,
                depth: ::std::os::raw::c_int,
                buf: *const ::std::os::raw::c_char,
                size: usize,
                errstr: *mut ::std::os::raw::c_char,
                errstr_size: usize,
                opaque: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    ) -> rd_kafka_conf_res_t;
}
#[repr(u32)]
#[doc = " @enum rd_kafka_cert_type_t\n\n @brief SSL certificate type\n\n @sa rd_kafka_conf_set_ssl_cert"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum rd_kafka_cert_type_t {
    #[doc = "< Client's public key"]
    RD_KAFKA_CERT_PUBLIC_KEY = 0,
    #[doc = "< Client's private key"]
    RD_KAFKA_CERT_PRIVATE_KEY = 1,
    #[doc = "< CA certificate"]
    RD_KAFKA_CERT_CA = 2,
    RD_KAFKA_CERT__CNT = 3,
}
#[repr(u32)]
#[doc = " @enum rd_kafka_cert_enc_t\n\n @brief SSL certificate encoding\n\n @sa rd_kafka_conf_set_ssl_cert"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum rd_kafka_cert_enc_t {
    #[doc = "< PKCS#12"]
    RD_KAFKA_CERT_ENC_PKCS12 = 0,
    #[doc = "< DER / binary X.509 ASN1"]
    RD_KAFKA_CERT_ENC_DER = 1,
    #[doc = "< PEM"]
    RD_KAFKA_CERT_ENC_PEM = 2,
    RD_KAFKA_CERT_ENC__CNT = 3,
}
unsafe extern "C" {
    #[doc = " @brief Set certificate/key \\p cert_type from the \\p cert_enc encoded\n        memory at \\p buffer of \\p size bytes.\n\n @param conf Configuration object.\n @param cert_type Certificate or key type to configure.\n @param cert_enc  Buffer \\p encoding type.\n @param buffer Memory pointer to encoded certificate or key.\n               The memory is not referenced after this function returns.\n @param size Size of memory at \\p buffer.\n @param errstr Memory were a human-readable error string will be written\n               on failure.\n @param errstr_size Size of \\p errstr, including space for nul-terminator.\n\n @returns RD_KAFKA_CONF_OK on success or RD_KAFKA_CONF_INVALID if the\n          memory in \\p buffer is of incorrect encoding, or if librdkafka\n          was not built with SSL support.\n\n @remark Calling this method multiple times with the same \\p cert_type\n         will replace the previous value.\n\n @remark Calling this method with \\p buffer set to NULL will clear the\n         configuration for \\p cert_type.\n\n @remark The private key may require a password, which must be specified\n         with the `ssl.key.password` configuration property prior to\n         calling this function.\n\n @remark Private and public keys in PEM format may also be set with the\n         `ssl.key.pem` and `ssl.certificate.pem` configuration properties.\n\n @remark CA certificate in PEM format may also be set with the\n         `ssl.ca.pem` configuration property.\n\n @remark When librdkafka is linked to OpenSSL 3.0 and the certificate is\n         encoded using an obsolete cipher, it might be necessary to set up\n         an OpenSSL configuration file to load the \"legacy\" provider and\n         set the OPENSSL_CONF environment variable.\n         See\n https://github.com/openssl/openssl/blob/master/README-PROVIDERS.md for more\n information."]
    pub fn rd_kafka_conf_set_ssl_cert(
        conf: *mut rd_kafka_conf_t,
        cert_type: rd_kafka_cert_type_t,
        cert_enc: rd_kafka_cert_enc_t,
        buffer: *const ::std::os::raw::c_void,
        size: usize,
        errstr: *mut ::std::os::raw::c_char,
        errstr_size: usize,
    ) -> rd_kafka_conf_res_t;
}
unsafe extern "C" {
    #[doc = " @brief Set callback_data for OpenSSL engine.\n\n @param conf Configuration object.\n @param callback_data passed to engine callbacks,\n                      e.g. \\c ENGINE_load_ssl_client_cert.\n\n @remark The \\c ssl.engine.location configuration must be set for this\n         to have affect.\n\n @remark The memory pointed to by \\p value must remain valid for the\n         lifetime of the configuration object and any Kafka clients that\n         use it."]
    pub fn rd_kafka_conf_set_engine_callback_data(
        conf: *mut rd_kafka_conf_t,
        callback_data: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    #[doc = " @brief Sets the application's opaque pointer that will be passed to callbacks\n\n @sa rd_kafka_opaque()"]
    pub fn rd_kafka_conf_set_opaque(
        conf: *mut rd_kafka_conf_t,
        opaque: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    #[doc = " @brief Retrieves the opaque pointer previously set\n        with rd_kafka_conf_set_opaque()"]
    pub fn rd_kafka_opaque(rk: *const rd_kafka_t) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " @brief Sets the default topic configuration to use for automatically\n        subscribed topics (e.g., through pattern-matched topics).\n        The topic config object is not usable after this call.\n\n @warning Any topic configuration settings that have been set on the\n          global rd_kafka_conf_t object will be overwritten by this call\n          since the implicitly created default topic config object is\n          replaced by the user-supplied one.\n\n @deprecated Set default topic level configuration on the\n             global rd_kafka_conf_t object instead."]
    pub fn rd_kafka_conf_set_default_topic_conf(
        conf: *mut rd_kafka_conf_t,
        tconf: *mut rd_kafka_topic_conf_t,
    );
}
unsafe extern "C" {
    #[doc = " @brief Gets the default topic configuration as previously set with\n        rd_kafka_conf_set_default_topic_conf() or that was implicitly created\n        by configuring a topic-level property on the global \\p conf object.\n\n @returns the \\p conf's default topic configuration (if any), or NULL.\n\n @warning The returned topic configuration object is owned by the \\p conf\n          object. It may be modified but not destroyed and its lifetime is\n          the same as the \\p conf object or the next call to\n          rd_kafka_conf_set_default_topic_conf()."]
    pub fn rd_kafka_conf_get_default_topic_conf(
        conf: *mut rd_kafka_conf_t,
    ) -> *mut rd_kafka_topic_conf_t;
}
unsafe extern "C" {
    #[doc = " @brief Retrieve configuration value for property \\p name.\n\n If \\p dest is non-NULL the value will be written to \\p dest with at\n most \\p dest_size.\n\n \\p *dest_size is updated to the full length of the value, thus if\n \\p *dest_size initially is smaller than the full length the application\n may reallocate \\p dest to fit the returned \\p *dest_size and try again.\n\n If \\p dest is NULL only the full length of the value is returned.\n\n Fallthrough:\n Topic-level configuration properties from the \\c default_topic_conf\n may be retrieved using this interface.\n\n @returns \\p RD_KAFKA_CONF_OK if the property name matched, else\n \\p RD_KAFKA_CONF_UNKNOWN."]
    pub fn rd_kafka_conf_get(
        conf: *const rd_kafka_conf_t,
        name: *const ::std::os::raw::c_char,
        dest: *mut ::std::os::raw::c_char,
        dest_size: *mut usize,
    ) -> rd_kafka_conf_res_t;
}
unsafe extern "C" {
    #[doc = " @brief Retrieve topic configuration value for property \\p name.\n\n @sa rd_kafka_conf_get()"]
    pub fn rd_kafka_topic_conf_get(
        conf: *const rd_kafka_topic_conf_t,
        name: *const ::std::os::raw::c_char,
        dest: *mut ::std::os::raw::c_char,
        dest_size: *mut usize,
    ) -> rd_kafka_conf_res_t;
}
unsafe extern "C" {
    #[doc = " @brief Dump the configuration properties and values of \\p conf to an array\n        with \\\"key\\\", \\\"value\\\" pairs.\n\n The number of entries in the array is returned in \\p *cntp.\n\n The dump must be freed with `rd_kafka_conf_dump_free()`."]
    pub fn rd_kafka_conf_dump(
        conf: *mut rd_kafka_conf_t,
        cntp: *mut usize,
    ) -> *mut *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " @brief Dump the topic configuration properties and values of \\p conf\n        to an array with \\\"key\\\", \\\"value\\\" pairs.\n\n The number of entries in the array is returned in \\p *cntp.\n\n The dump must be freed with `rd_kafka_conf_dump_free()`."]
    pub fn rd_kafka_topic_conf_dump(
        conf: *mut rd_kafka_topic_conf_t,
        cntp: *mut usize,
    ) -> *mut *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " @brief Frees a configuration dump returned from `rd_kafka_conf_dump()` or\n        `rd_kafka_topic_conf_dump()."]
    pub fn rd_kafka_conf_dump_free(arr: *mut *const ::std::os::raw::c_char, cnt: usize);
}
unsafe extern "C" {
    #[doc = " @brief Prints a table to \\p fp of all supported configuration properties,\n        their default values as well as a description.\n\n @remark All properties and properties and values are shown, even those\n         that have been disabled at build time due to missing dependencies."]
    pub fn rd_kafka_conf_properties_show(fp: *mut FILE);
}
unsafe extern "C" {
    #[doc = " @brief Create topic configuration object\n\n @sa Same semantics as for rd_kafka_conf_new()."]
    pub fn rd_kafka_topic_conf_new() -> *mut rd_kafka_topic_conf_t;
}
unsafe extern "C" {
    #[doc = " @brief Creates a copy/duplicate of topic configuration object \\p conf."]
    pub fn rd_kafka_topic_conf_dup(
        conf: *const rd_kafka_topic_conf_t,
    ) -> *mut rd_kafka_topic_conf_t;
}
unsafe extern "C" {
    #[doc = " @brief Creates a copy/duplicate of \\p rk 's default topic configuration\n        object."]
    pub fn rd_kafka_default_topic_conf_dup(rk: *mut rd_kafka_t) -> *mut rd_kafka_topic_conf_t;
}
unsafe extern "C" {
    #[doc = " @brief Destroys a topic conf object."]
    pub fn rd_kafka_topic_conf_destroy(topic_conf: *mut rd_kafka_topic_conf_t);
}
unsafe extern "C" {
    #[doc = " @brief Sets a single rd_kafka_topic_conf_t value by property name.\n\n \\p topic_conf should have been previously set up\n with `rd_kafka_topic_conf_new()`.\n\n @returns rd_kafka_conf_res_t to indicate success or failure."]
    pub fn rd_kafka_topic_conf_set(
        conf: *mut rd_kafka_topic_conf_t,
        name: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
        errstr: *mut ::std::os::raw::c_char,
        errstr_size: usize,
    ) -> rd_kafka_conf_res_t;
}
unsafe extern "C" {
    #[doc = " @brief Sets the application's opaque pointer that will be passed to all topic\n callbacks as the \\c rkt_opaque argument.\n\n @sa rd_kafka_topic_opaque()"]
    pub fn rd_kafka_topic_conf_set_opaque(
        conf: *mut rd_kafka_topic_conf_t,
        rkt_opaque: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    #[doc = " @brief \\b Producer: Set partitioner callback in provided topic conf object.\n\n The partitioner may be called in any thread at any time,\n it may be called multiple times for the same message/key.\n\n The callback's \\p rkt_opaque argument is the opaque set by\n rd_kafka_topic_conf_set_opaque().\n The callback's \\p msg_opaque argument is the per-message opaque\n passed to produce().\n\n Partitioner function constraints:\n   - MUST NOT call any rd_kafka_*() functions except:\n       rd_kafka_topic_partition_available()\n   - MUST NOT block or execute for prolonged periods of time.\n   - MUST return a value between 0 and partition_cnt-1, or the\n     special \\c RD_KAFKA_PARTITION_UA value if partitioning\n     could not be performed."]
    pub fn rd_kafka_topic_conf_set_partitioner_cb(
        topic_conf: *mut rd_kafka_topic_conf_t,
        partitioner: ::std::option::Option<
            unsafe extern "C" fn(
                rkt: *const rd_kafka_topic_t,
                keydata: *const ::std::os::raw::c_void,
                keylen: usize,
                partition_cnt: i32,
                rkt_opaque: *mut ::std::os::raw::c_void,
                msg_opaque: *mut ::std::os::raw::c_void,
            ) -> i32,
        >,
    );
}
unsafe extern "C" {
    #[doc = " @brief \\b Producer: Set message queueing order comparator callback.\n\n The callback may be called in any thread at any time,\n it may be called multiple times for the same message.\n\n Ordering comparator function constraints:\n   - MUST be stable sort (same input gives same output).\n   - MUST NOT call any rd_kafka_*() functions.\n   - MUST NOT block or execute for prolonged periods of time.\n\n The comparator shall compare the two messages and return:\n  - < 0 if message \\p a should be inserted before message \\p b.\n  - >=0 if message \\p a should be inserted after message \\p b.\n\n @remark Insert sorting will be used to enqueue the message in the\n         correct queue position, this comes at a cost of O(n).\n\n @remark If `queuing.strategy=fifo` new messages are enqueued to the\n         tail of the queue regardless of msg_order_cmp, but retried messages\n         are still affected by msg_order_cmp.\n\n @warning THIS IS AN EXPERIMENTAL API, SUBJECT TO CHANGE OR REMOVAL,\n          DO NOT USE IN PRODUCTION."]
    pub fn rd_kafka_topic_conf_set_msg_order_cmp(
        topic_conf: *mut rd_kafka_topic_conf_t,
        msg_order_cmp: ::std::option::Option<
            unsafe extern "C" fn(
                a: *const rd_kafka_message_t,
                b: *const rd_kafka_message_t,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    #[doc = " @brief Check if partition is available (has a leader broker).\n\n @returns 1 if the partition is available, else 0.\n\n @warning This function must only be called from inside a partitioner function"]
    pub fn rd_kafka_topic_partition_available(
        rkt: *const rd_kafka_topic_t,
        partition: i32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Random partitioner.\n\n Will try not to return unavailable partitions.\n\n The \\p rkt_opaque argument is the opaque set by\n rd_kafka_topic_conf_set_opaque().\n The \\p msg_opaque argument is the per-message opaque\n passed to produce().\n\n @returns a random partition between 0 and \\p partition_cnt - 1.\n"]
    pub fn rd_kafka_msg_partitioner_random(
        rkt: *const rd_kafka_topic_t,
        key: *const ::std::os::raw::c_void,
        keylen: usize,
        partition_cnt: i32,
        rkt_opaque: *mut ::std::os::raw::c_void,
        msg_opaque: *mut ::std::os::raw::c_void,
    ) -> i32;
}
unsafe extern "C" {
    #[doc = " @brief Consistent partitioner.\n\n Uses consistent hashing to map identical keys onto identical partitions.\n\n The \\p rkt_opaque argument is the opaque set by\n rd_kafka_topic_conf_set_opaque().\n The \\p msg_opaque argument is the per-message opaque\n passed to produce().\n\n @returns a \\\"random\\\" partition between 0 and \\p partition_cnt - 1 based on\n          the CRC value of the key"]
    pub fn rd_kafka_msg_partitioner_consistent(
        rkt: *const rd_kafka_topic_t,
        key: *const ::std::os::raw::c_void,
        keylen: usize,
        partition_cnt: i32,
        rkt_opaque: *mut ::std::os::raw::c_void,
        msg_opaque: *mut ::std::os::raw::c_void,
    ) -> i32;
}
unsafe extern "C" {
    #[doc = " @brief Consistent-Random partitioner.\n\n This is the default partitioner.\n Uses consistent hashing to map identical keys onto identical partitions, and\n messages without keys will be assigned via the random partitioner.\n\n The \\p rkt_opaque argument is the opaque set by\n rd_kafka_topic_conf_set_opaque().\n The \\p msg_opaque argument is the per-message opaque\n passed to produce().\n\n @returns a \\\"random\\\" partition between 0 and \\p partition_cnt - 1 based on\n          the CRC value of the key (if provided)"]
    pub fn rd_kafka_msg_partitioner_consistent_random(
        rkt: *const rd_kafka_topic_t,
        key: *const ::std::os::raw::c_void,
        keylen: usize,
        partition_cnt: i32,
        rkt_opaque: *mut ::std::os::raw::c_void,
        msg_opaque: *mut ::std::os::raw::c_void,
    ) -> i32;
}
unsafe extern "C" {
    #[doc = " @brief Murmur2 partitioner (Java compatible).\n\n Uses consistent hashing to map identical keys onto identical partitions\n using Java-compatible Murmur2 hashing.\n\n The \\p rkt_opaque argument is the opaque set by\n rd_kafka_topic_conf_set_opaque().\n The \\p msg_opaque argument is the per-message opaque\n passed to produce().\n\n @returns a partition between 0 and \\p partition_cnt - 1."]
    pub fn rd_kafka_msg_partitioner_murmur2(
        rkt: *const rd_kafka_topic_t,
        key: *const ::std::os::raw::c_void,
        keylen: usize,
        partition_cnt: i32,
        rkt_opaque: *mut ::std::os::raw::c_void,
        msg_opaque: *mut ::std::os::raw::c_void,
    ) -> i32;
}
unsafe extern "C" {
    #[doc = " @brief Consistent-Random Murmur2 partitioner (Java compatible).\n\n Uses consistent hashing to map identical keys onto identical partitions\n using Java-compatible Murmur2 hashing.\n Messages without keys will be assigned via the random partitioner.\n\n The \\p rkt_opaque argument is the opaque set by\n rd_kafka_topic_conf_set_opaque().\n The \\p msg_opaque argument is the per-message opaque\n passed to produce().\n\n @returns a partition between 0 and \\p partition_cnt - 1."]
    pub fn rd_kafka_msg_partitioner_murmur2_random(
        rkt: *const rd_kafka_topic_t,
        key: *const ::std::os::raw::c_void,
        keylen: usize,
        partition_cnt: i32,
        rkt_opaque: *mut ::std::os::raw::c_void,
        msg_opaque: *mut ::std::os::raw::c_void,
    ) -> i32;
}
unsafe extern "C" {
    #[doc = " @brief FNV-1a partitioner.\n\n Uses consistent hashing to map identical keys onto identical partitions\n using FNV-1a hashing.\n\n The \\p rkt_opaque argument is the opaque set by\n rd_kafka_topic_conf_set_opaque().\n The \\p msg_opaque argument is the per-message opaque\n passed to produce().\n\n @returns a partition between 0 and \\p partition_cnt - 1."]
    pub fn rd_kafka_msg_partitioner_fnv1a(
        rkt: *const rd_kafka_topic_t,
        key: *const ::std::os::raw::c_void,
        keylen: usize,
        partition_cnt: i32,
        rkt_opaque: *mut ::std::os::raw::c_void,
        msg_opaque: *mut ::std::os::raw::c_void,
    ) -> i32;
}
unsafe extern "C" {
    #[doc = " @brief Consistent-Random FNV-1a partitioner.\n\n Uses consistent hashing to map identical keys onto identical partitions\n using FNV-1a hashing.\n Messages without keys will be assigned via the random partitioner.\n\n The \\p rkt_opaque argument is the opaque set by\n rd_kafka_topic_conf_set_opaque().\n The \\p msg_opaque argument is the per-message opaque\n passed to produce().\n\n @returns a partition between 0 and \\p partition_cnt - 1."]
    pub fn rd_kafka_msg_partitioner_fnv1a_random(
        rkt: *const rd_kafka_topic_t,
        key: *const ::std::os::raw::c_void,
        keylen: usize,
        partition_cnt: i32,
        rkt_opaque: *mut ::std::os::raw::c_void,
        msg_opaque: *mut ::std::os::raw::c_void,
    ) -> i32;
}
unsafe extern "C" {
    #[doc = " @brief Creates a new Kafka handle and starts its operation according to the\n        specified \\p type (\\p RD_KAFKA_CONSUMER or \\p RD_KAFKA_PRODUCER).\n\n \\p conf is an optional struct created with `rd_kafka_conf_new()` that will\n be used instead of the default configuration.\n The \\p conf object is freed by this function on success and must not be used\n or destroyed by the application subsequently.\n See `rd_kafka_conf_set()` et.al for more information.\n\n \\p errstr must be a pointer to memory of at least size \\p errstr_size where\n `rd_kafka_new()` may write a human readable error message in case the\n creation of a new handle fails. In which case the function returns NULL.\n\n @remark \\b RD_KAFKA_CONSUMER: When a new \\p RD_KAFKA_CONSUMER\n           rd_kafka_t handle is created it may either operate in the\n           legacy simple consumer mode using the rd_kafka_consume_start()\n           interface, or the High-level KafkaConsumer API.\n @remark An application must only use one of these groups of APIs on a given\n         rd_kafka_t RD_KAFKA_CONSUMER handle.\n\n\n @returns The Kafka handle on success or NULL on error (see \\p errstr)\n\n @sa To destroy the Kafka handle, use rd_kafka_destroy()."]
    pub fn rd_kafka_new(
        type_: rd_kafka_type_t,
        conf: *mut rd_kafka_conf_t,
        errstr: *mut ::std::os::raw::c_char,
        errstr_size: usize,
    ) -> *mut rd_kafka_t;
}
unsafe extern "C" {
    #[doc = " @brief Destroy Kafka handle.\n\n @remark This is a blocking operation.\n @remark rd_kafka_consumer_close() will be called from this function\n         if the instance type is RD_KAFKA_CONSUMER, a \\c group.id was\n         configured, and the rd_kafka_consumer_close() was not\n         explicitly called by the application. This in turn may\n         trigger consumer callbacks, such as rebalance_cb.\n         Use rd_kafka_destroy_flags() with\n         RD_KAFKA_DESTROY_F_NO_CONSUMER_CLOSE to avoid this behaviour.\n\n @sa rd_kafka_destroy_flags()"]
    pub fn rd_kafka_destroy(rk: *mut rd_kafka_t);
}
unsafe extern "C" {
    #[doc = " @brief Destroy Kafka handle according to specified destroy flags\n"]
    pub fn rd_kafka_destroy_flags(rk: *mut rd_kafka_t, flags: ::std::os::raw::c_int);
}
unsafe extern "C" {
    #[doc = " @brief Returns Kafka handle name."]
    pub fn rd_kafka_name(rk: *const rd_kafka_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " @brief Returns Kafka handle type."]
    pub fn rd_kafka_type(rk: *const rd_kafka_t) -> rd_kafka_type_t;
}
unsafe extern "C" {
    #[doc = " @brief Returns this client's broker-assigned group member id.\n\n @remark This currently requires the high-level KafkaConsumer\n\n @returns An allocated string containing the current broker-assigned group\n          member id, or NULL if not available.\n          The application must free the string with \\p free() or\n          rd_kafka_mem_free()"]
    pub fn rd_kafka_memberid(rk: *const rd_kafka_t) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " @brief Returns the ClusterId as reported in broker metadata.\n\n @param rk         Client instance.\n @param timeout_ms If there is no cached value from metadata retrieval\n                   then this specifies the maximum amount of time\n                   (in milliseconds) the call will block waiting\n                   for metadata to be retrieved.\n                   Use 0 for non-blocking calls.\n\n @remark Requires broker version >=0.10.0 and api.version.request=true.\n\n @remark The application must free the returned pointer\n         using rd_kafka_mem_free().\n\n @returns a newly allocated string containing the ClusterId, or NULL\n          if no ClusterId could be retrieved in the allotted timespan."]
    pub fn rd_kafka_clusterid(
        rk: *mut rd_kafka_t,
        timeout_ms: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " @brief Returns the current ControllerId as reported in broker metadata.\n\n @param rk         Client instance.\n @param timeout_ms If there is no cached value from metadata retrieval\n                   then this specifies the maximum amount of time\n                   (in milliseconds) the call will block waiting\n                   for metadata to be retrieved.\n                   Use 0 for non-blocking calls.\n\n @remark Requires broker version >=0.10.0 and api.version.request=true.\n\n @returns the controller broker id (>= 0), or -1 if no ControllerId could be\n          retrieved in the allotted timespan."]
    pub fn rd_kafka_controllerid(rk: *mut rd_kafka_t, timeout_ms: ::std::os::raw::c_int) -> i32;
}
unsafe extern "C" {
    #[doc = " @brief Creates a new topic handle for topic named \\p topic.\n\n \\p conf is an optional configuration for the topic created with\n `rd_kafka_topic_conf_new()` that will be used instead of the default\n topic configuration.\n The \\p conf object is freed by this function and must not be used or\n destroyed by the application subsequently.\n See `rd_kafka_topic_conf_set()` et.al for more information.\n\n Topic handles are refcounted internally and calling rd_kafka_topic_new()\n again with the same topic name will return the previous topic handle\n without updating the original handle's configuration.\n Applications must eventually call rd_kafka_topic_destroy() for each\n succesfull call to rd_kafka_topic_new() to clear up resources.\n\n @returns the new topic handle or NULL on error (use rd_kafka_errno2err()\n          to convert system \\p errno to an rd_kafka_resp_err_t error code.\n\n @sa rd_kafka_topic_destroy()"]
    pub fn rd_kafka_topic_new(
        rk: *mut rd_kafka_t,
        topic: *const ::std::os::raw::c_char,
        conf: *mut rd_kafka_topic_conf_t,
    ) -> *mut rd_kafka_topic_t;
}
unsafe extern "C" {
    #[doc = " @brief Loose application's topic handle refcount as previously created\n        with `rd_kafka_topic_new()`.\n\n @remark Since topic objects are refcounted (both internally and for the app)\n         the topic object might not actually be destroyed by this call,\n         but the application must consider the object destroyed."]
    pub fn rd_kafka_topic_destroy(rkt: *mut rd_kafka_topic_t);
}
unsafe extern "C" {
    #[doc = " @brief Returns the topic name."]
    pub fn rd_kafka_topic_name(rkt: *const rd_kafka_topic_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " @brief Get the \\p rkt_opaque pointer that was set in the topic configuration\n        with rd_kafka_topic_conf_set_opaque()."]
    pub fn rd_kafka_topic_opaque(rkt: *const rd_kafka_topic_t) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " @brief Polls the provided kafka handle for events.\n\n Events will cause application-provided callbacks to be called.\n\n The \\p timeout_ms argument specifies the maximum amount of time\n (in milliseconds) that the call will block waiting for events.\n For non-blocking calls, provide 0 as \\p timeout_ms.\n To wait indefinitely for an event, provide -1.\n\n @remark  An application should make sure to call poll() at regular\n          intervals to serve any queued callbacks waiting to be called.\n @remark  If your producer doesn't have any callback set (in particular\n          via rd_kafka_conf_set_dr_msg_cb or rd_kafka_conf_set_error_cb)\n          you might choose not to call poll(), though this is not\n          recommended.\n\n Events:\n   - delivery report callbacks (if dr_cb/dr_msg_cb is configured) [producer]\n   - error callbacks (rd_kafka_conf_set_error_cb()) [all]\n   - stats callbacks (rd_kafka_conf_set_stats_cb()) [all]\n   - throttle callbacks (rd_kafka_conf_set_throttle_cb()) [all]\n   - OAUTHBEARER token refresh callbacks\n (rd_kafka_conf_set_oauthbearer_token_refresh_cb()) [all]\n\n @returns the number of events served."]
    pub fn rd_kafka_poll(
        rk: *mut rd_kafka_t,
        timeout_ms: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Cancels the current callback dispatcher (rd_kafka_poll(),\n        rd_kafka_consume_callback(), etc).\n\n A callback may use this to force an immediate return to the calling\n code (caller of e.g. rd_kafka_poll()) without processing any further\n events.\n\n @remark This function MUST ONLY be called from within a librdkafka callback."]
    pub fn rd_kafka_yield(rk: *mut rd_kafka_t);
}
unsafe extern "C" {
    #[doc = " @brief Pause producing or consumption for the provided list of partitions.\n\n Success or error is returned per-partition \\p err in the \\p partitions list.\n\n @returns RD_KAFKA_RESP_ERR_NO_ERROR"]
    pub fn rd_kafka_pause_partitions(
        rk: *mut rd_kafka_t,
        partitions: *mut rd_kafka_topic_partition_list_t,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Resume producing consumption for the provided list of partitions.\n\n Success or error is returned per-partition \\p err in the \\p partitions list.\n\n @returns RD_KAFKA_RESP_ERR_NO_ERROR"]
    pub fn rd_kafka_resume_partitions(
        rk: *mut rd_kafka_t,
        partitions: *mut rd_kafka_topic_partition_list_t,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Query broker for low (oldest/beginning) and high (newest/end) offsets\n        for partition.\n\n Offsets are returned in \\p *low and \\p *high respectively.\n\n @returns RD_KAFKA_RESP_ERR_NO_ERROR on success or an error code on failure."]
    pub fn rd_kafka_query_watermark_offsets(
        rk: *mut rd_kafka_t,
        topic: *const ::std::os::raw::c_char,
        partition: i32,
        low: *mut i64,
        high: *mut i64,
        timeout_ms: ::std::os::raw::c_int,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Get last known low (oldest/beginning) and high (newest/end) offsets\n        for partition.\n\n The low offset is updated periodically (if statistics.interval.ms is set)\n while the high offset is updated on each fetched message set from the broker.\n\n If there is no cached offset (either low or high, or both) then\n RD_KAFKA_OFFSET_INVALID will be returned for the respective offset.\n\n Offsets are returned in \\p *low and \\p *high respectively.\n\n @returns RD_KAFKA_RESP_ERR_NO_ERROR on success or an error code on failure.\n\n @remark Shall only be used with an active consumer instance."]
    pub fn rd_kafka_get_watermark_offsets(
        rk: *mut rd_kafka_t,
        topic: *const ::std::os::raw::c_char,
        partition: i32,
        low: *mut i64,
        high: *mut i64,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Look up the offsets for the given partitions by timestamp.\n\n The returned offset for each partition is the earliest offset whose\n timestamp is greater than or equal to the given timestamp in the\n corresponding partition.\n\n The timestamps to query are represented as \\c offset in \\p offsets\n on input, and \\c offset will contain the offset on output.\n\n The function will block for at most \\p timeout_ms milliseconds.\n\n @remark Duplicate Topic+Partitions are not supported.\n @remark Per-partition errors may be returned in \\c\n rd_kafka_topic_partition_t.err\n\n @returns RD_KAFKA_RESP_ERR_NO_ERROR if offsets were be queried (do note\n          that per-partition errors might be set),\n          RD_KAFKA_RESP_ERR__TIMED_OUT if not all offsets could be fetched\n          within \\p timeout_ms,\n          RD_KAFKA_RESP_ERR__INVALID_ARG if the \\p offsets list is empty,\n          RD_KAFKA_RESP_ERR__UNKNOWN_PARTITION if all partitions are unknown,\n          RD_KAFKA_RESP_ERR_LEADER_NOT_AVAILABLE if unable to query leaders\n          for the given partitions."]
    pub fn rd_kafka_offsets_for_times(
        rk: *mut rd_kafka_t,
        offsets: *mut rd_kafka_topic_partition_list_t,
        timeout_ms: ::std::os::raw::c_int,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Allocate and zero memory using the same allocator librdkafka uses.\n\n This is typically an abstraction for the calloc(3) call and makes sure\n the application can use the same memory allocator as librdkafka for\n allocating pointers that are used by librdkafka.\n\n \\p rk can be set to return memory allocated by a specific \\c rk instance\n otherwise pass NULL for \\p rk.\n\n @remark Memory allocated by rd_kafka_mem_calloc() must be freed using\n         rd_kafka_mem_free()"]
    pub fn rd_kafka_mem_calloc(
        rk: *mut rd_kafka_t,
        num: usize,
        size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " @brief Allocate memory using the same allocator librdkafka uses.\n\n This is typically an abstraction for the malloc(3) call and makes sure\n the application can use the same memory allocator as librdkafka for\n allocating pointers that are used by librdkafka.\n\n \\p rk can be set to return memory allocated by a specific \\c rk instance\n otherwise pass NULL for \\p rk.\n\n @remark Memory allocated by rd_kafka_mem_malloc() must be freed using\n         rd_kafka_mem_free()"]
    pub fn rd_kafka_mem_malloc(rk: *mut rd_kafka_t, size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " @brief Free pointer returned by librdkafka\n\n This is typically an abstraction for the free(3) call and makes sure\n the application can use the same memory allocator as librdkafka for\n freeing pointers returned by librdkafka.\n\n In standard setups it is usually not necessary to use this interface\n rather than the free(3) functione.\n\n \\p rk must be set for memory returned by APIs that take an \\c rk argument,\n for other APIs pass NULL for \\p rk.\n\n @remark rd_kafka_mem_free() must only be used for pointers returned by APIs\n         that explicitly mention using this function for freeing."]
    pub fn rd_kafka_mem_free(rk: *mut rd_kafka_t, ptr: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    #[doc = " @brief Create a new message queue.\n\n See rd_kafka_consume_start_queue(), rd_kafka_consume_queue(), et.al."]
    pub fn rd_kafka_queue_new(rk: *mut rd_kafka_t) -> *mut rd_kafka_queue_t;
}
unsafe extern "C" {
    #[doc = " Destroy a queue, purging all of its enqueued messages."]
    pub fn rd_kafka_queue_destroy(rkqu: *mut rd_kafka_queue_t);
}
unsafe extern "C" {
    #[doc = " @returns a reference to the main librdkafka event queue.\n This is the queue served by rd_kafka_poll().\n\n Use rd_kafka_queue_destroy() to loose the reference."]
    pub fn rd_kafka_queue_get_main(rk: *mut rd_kafka_t) -> *mut rd_kafka_queue_t;
}
unsafe extern "C" {
    #[doc = " @returns a reference to the SASL callback queue, if a SASL mechanism\n          with callbacks is configured (currently only OAUTHBEARER), else\n          returns NULL.\n\n Use rd_kafka_queue_destroy() to loose the reference.\n\n @sa rd_kafka_sasl_background_callbacks_enable()"]
    pub fn rd_kafka_queue_get_sasl(rk: *mut rd_kafka_t) -> *mut rd_kafka_queue_t;
}
unsafe extern "C" {
    #[doc = " @brief Enable SASL OAUTHBEARER refresh callbacks on the librdkafka\n        background thread.\n\n This serves as an alternative for applications that do not call\n rd_kafka_poll() (et.al.) at regular intervals (or not at all), as a means\n of automatically trigger the refresh callbacks, which are needed to\n initiate connections to the brokers in the case a custom OAUTHBEARER\n refresh callback is configured.\n\n @returns NULL on success or an error object on error.\n\n @sa rd_kafka_queue_get_sasl()\n @sa rd_kafka_conf_set_oauthbearer_token_refresh_cb()"]
    pub fn rd_kafka_sasl_background_callbacks_enable(rk: *mut rd_kafka_t) -> *mut rd_kafka_error_t;
}
unsafe extern "C" {
    #[doc = " @brief Sets SASL credentials used for SASL PLAIN and SCRAM mechanisms by\n        this Kafka client.\n\n This function sets or resets the SASL username and password credentials\n used by this Kafka client. The new credentials will be used the next time\n this client needs to authenticate to a broker. This function\n will not disconnect existing connections that might have been made using\n the old credentials.\n\n @remark This function only applies to the SASL PLAIN and SCRAM mechanisms.\n\n @returns NULL on success or an error object on error."]
    pub fn rd_kafka_sasl_set_credentials(
        rk: *mut rd_kafka_t,
        username: *const ::std::os::raw::c_char,
        password: *const ::std::os::raw::c_char,
    ) -> *mut rd_kafka_error_t;
}
unsafe extern "C" {
    #[doc = " @returns a reference to the librdkafka consumer queue.\n This is the queue served by rd_kafka_consumer_poll().\n\n Use rd_kafka_queue_destroy() to loose the reference.\n\n @remark rd_kafka_queue_destroy() MUST be called on this queue\n         prior to calling rd_kafka_consumer_close().\n @remark Polling the returned queue counts as a consumer poll, and will reset\n         the timer for max.poll.interval.ms. If this queue is forwarded to a\n         \"destq\", polling destq also counts as a consumer poll (this works\n         for any number of forwards). However, even if this queue is\n         unforwarded or forwarded elsewhere, polling destq will continue\n         to count as a consumer poll."]
    pub fn rd_kafka_queue_get_consumer(rk: *mut rd_kafka_t) -> *mut rd_kafka_queue_t;
}
unsafe extern "C" {
    #[doc = " @returns a reference to the partition's queue, or NULL if\n          partition is invalid.\n\n Use rd_kafka_queue_destroy() to loose the reference.\n\n @remark rd_kafka_queue_destroy() MUST be called on this queue\n\n @remark This function only works on consumers."]
    pub fn rd_kafka_queue_get_partition(
        rk: *mut rd_kafka_t,
        topic: *const ::std::os::raw::c_char,
        partition: i32,
    ) -> *mut rd_kafka_queue_t;
}
unsafe extern "C" {
    #[doc = " @returns a reference to the background thread queue, or NULL if the\n          background queue is not enabled.\n\n The background thread queue provides the application with an automatically\n polled queue that triggers the event callback in a background thread,\n this background thread is completely managed by librdkafka.\n\n The background thread queue is automatically created if a generic event\n handler callback is configured with rd_kafka_conf_set_background_event_cb()\n or if rd_kafka_queue_get_background() is called.\n\n The background queue is polled and served by librdkafka and MUST NOT be\n polled, forwarded, or otherwise managed by the application, it may only\n be used as the destination queue passed to queue-enabled APIs, such as\n the Admin API.\n\n Use rd_kafka_queue_destroy() to loose the reference.\n\n @warning The background queue MUST NOT be read from (polled, consumed, etc),\n          or forwarded from."]
    pub fn rd_kafka_queue_get_background(rk: *mut rd_kafka_t) -> *mut rd_kafka_queue_t;
}
unsafe extern "C" {
    #[doc = " @brief Forward/re-route queue \\p src to \\p dst.\n If \\p dst is \\c NULL the forwarding is removed.\n\n The internal refcounts for both queues are increased.\n\n @remark Regardless of whether \\p dst is NULL or not, after calling this\n         function, \\p src will not forward it's fetch queue to the consumer\n         queue."]
    pub fn rd_kafka_queue_forward(src: *mut rd_kafka_queue_t, dst: *mut rd_kafka_queue_t);
}
unsafe extern "C" {
    #[doc = " @brief Forward librdkafka logs (and debug) to the specified queue\n        for serving with one of the ..poll() calls.\n\n        This allows an application to serve log callbacks (\\c log_cb)\n        in its thread of choice.\n\n @param rk   Client instance.\n @param rkqu Queue to forward logs to. If the value is NULL the logs\n        are forwarded to the main queue.\n\n @remark The configuration property \\c log.queue MUST also be set to true.\n\n @remark librdkafka maintains its own reference to the provided queue.\n\n @returns RD_KAFKA_RESP_ERR_NO_ERROR on success or an error code on error,\n eg RD_KAFKA_RESP_ERR__NOT_CONFIGURED when log.queue is not set to true."]
    pub fn rd_kafka_set_log_queue(
        rk: *mut rd_kafka_t,
        rkqu: *mut rd_kafka_queue_t,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @returns the current number of elements in queue."]
    pub fn rd_kafka_queue_length(rkqu: *mut rd_kafka_queue_t) -> usize;
}
unsafe extern "C" {
    #[doc = " @brief Enable IO event triggering for queue.\n\n To ease integration with IO based polling loops this API\n allows an application to create a separate file-descriptor\n that librdkafka will write \\p payload (of size \\p size) to\n whenever a new element is enqueued on a previously empty queue.\n\n To remove event triggering call with \\p fd = -1.\n\n librdkafka will maintain a copy of the \\p payload.\n\n @remark IO and callback event triggering are mutually exclusive.\n @remark When using forwarded queues the IO event must only be enabled\n         on the final forwarded-to (destination) queue.\n @remark The file-descriptor/socket must be set to non-blocking."]
    pub fn rd_kafka_queue_io_event_enable(
        rkqu: *mut rd_kafka_queue_t,
        fd: ::std::os::raw::c_int,
        payload: *const ::std::os::raw::c_void,
        size: usize,
    );
}
unsafe extern "C" {
    #[doc = " @brief Enable callback event triggering for queue.\n\n The callback will be called from an internal librdkafka thread\n when a new element is enqueued on a previously empty queue.\n\n To remove event triggering call with \\p event_cb = NULL.\n\n The \\p qev_opaque is passed to the callback's \\p qev_opaque argument.\n\n @remark IO and callback event triggering are mutually exclusive.\n @remark Since the callback may be triggered from internal librdkafka\n         threads, the application must not perform any pro-longed work in\n         the callback, or call any librdkafka APIs (for the same rd_kafka_t\n         handle)."]
    pub fn rd_kafka_queue_cb_event_enable(
        rkqu: *mut rd_kafka_queue_t,
        event_cb: ::std::option::Option<
            unsafe extern "C" fn(rk: *mut rd_kafka_t, qev_opaque: *mut ::std::os::raw::c_void),
        >,
        qev_opaque: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    #[doc = " @brief Cancels the current rd_kafka_queue_poll() on \\p rkqu.\n\n An application may use this from another thread to force\n an immediate return to the calling code (caller of rd_kafka_queue_poll()).\n Must not be used from signal handlers since that may cause deadlocks."]
    pub fn rd_kafka_queue_yield(rkqu: *mut rd_kafka_queue_t);
}
unsafe extern "C" {
    #[doc = " @brief Start consuming messages for topic \\p rkt and \\p partition\n at offset \\p offset which may either be an absolute \\c (0..N)\n or one of the logical offsets:\n  - RD_KAFKA_OFFSET_BEGINNING\n  - RD_KAFKA_OFFSET_END\n  - RD_KAFKA_OFFSET_STORED\n  - RD_KAFKA_OFFSET_TAIL\n\n rdkafka will attempt to keep \\c queued.min.messages (config property)\n messages in the local queue by repeatedly fetching batches of messages\n from the broker until the threshold is reached.\n\n The application shall use one of the `rd_kafka_consume*()` functions\n to consume messages from the local queue, each kafka message being\n represented as a `rd_kafka_message_t *` object.\n\n `rd_kafka_consume_start()` must not be called multiple times for the same\n topic and partition without stopping consumption first with\n `rd_kafka_consume_stop()`.\n\n @returns 0 on success or -1 on error in which case errno is set accordingly:\n  - EBUSY    - Conflicts with an existing or previous subscription\n               (RD_KAFKA_RESP_ERR__CONFLICT)\n  - EINVAL   - Invalid offset, or incomplete configuration (lacking group.id)\n               (RD_KAFKA_RESP_ERR__INVALID_ARG)\n  - ESRCH    - requested \\p partition is invalid.\n               (RD_KAFKA_RESP_ERR__UNKNOWN_PARTITION)\n  - ENOENT   - topic is unknown in the Kafka cluster.\n               (RD_KAFKA_RESP_ERR__UNKNOWN_TOPIC)\n\n Use `rd_kafka_errno2err()` to convert sytem \\c errno to `rd_kafka_resp_err_t`"]
    pub fn rd_kafka_consume_start(
        rkt: *mut rd_kafka_topic_t,
        partition: i32,
        offset: i64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Same as rd_kafka_consume_start() but re-routes incoming messages to\n the provided queue \\p rkqu (which must have been previously allocated\n with `rd_kafka_queue_new()`.\n\n The application must use one of the `rd_kafka_consume_*_queue()` functions\n to receive fetched messages.\n\n `rd_kafka_consume_start_queue()` must not be called multiple times for the\n same topic and partition without stopping consumption first with\n `rd_kafka_consume_stop()`.\n `rd_kafka_consume_start()` and `rd_kafka_consume_start_queue()` must not\n be combined for the same topic and partition."]
    pub fn rd_kafka_consume_start_queue(
        rkt: *mut rd_kafka_topic_t,
        partition: i32,
        offset: i64,
        rkqu: *mut rd_kafka_queue_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Stop consuming messages for topic \\p rkt and \\p partition, purging\n all messages currently in the local queue.\n\n NOTE: To enforce synchronisation this call will block until the internal\n       fetcher has terminated and offsets are committed to configured\n       storage method.\n\n The application needs to be stop all consumers before calling\n `rd_kafka_destroy()` on the main object handle.\n\n @returns 0 on success or -1 on error (see `errno`)."]
    pub fn rd_kafka_consume_stop(
        rkt: *mut rd_kafka_topic_t,
        partition: i32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Seek consumer for topic+partition to \\p offset which is either an\n        absolute or logical offset.\n\n If \\p timeout_ms is specified (not 0) the seek call will wait this long\n for the consumer to update its fetcher state for the given partition with\n the new offset. This guarantees that no previously fetched messages for the\n old offset (or fetch position) will be passed to the application.\n\n If the timeout is reached the internal state will be unknown to the caller\n and this function returns `RD_KAFKA_RESP_ERR__TIMED_OUT`.\n\n If \\p timeout_ms is 0 it will initiate the seek but return\n immediately without any error reporting (e.g., async).\n\n This call will purge all pre-fetched messages for the given partition, which\n may be up to \\c queued.max.message.kbytes in size. Repeated use of seek\n may thus lead to increased network usage as messages are re-fetched from\n the broker.\n\n @remark Seek must only be performed for already assigned/consumed partitions,\n         use rd_kafka_assign() (et.al) to set the initial starting offset\n         for a new assignmenmt.\n\n @returns `RD_KAFKA_RESP_ERR__NO_ERROR` on success else an error code.\n\n @deprecated Use rd_kafka_seek_partitions()."]
    pub fn rd_kafka_seek(
        rkt: *mut rd_kafka_topic_t,
        partition: i32,
        offset: i64,
        timeout_ms: ::std::os::raw::c_int,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Seek consumer for partitions in \\p partitions to the per-partition\n        offset in the \\c .offset field of \\p partitions.\n\n The offset may be either absolute (>= 0) or a logical offset.\n\n If \\p timeout_ms is specified (not 0) the seek call will wait this long\n for the consumer to update its fetcher state for the given partition with\n the new offset. This guarantees that no previously fetched messages for the\n old offset (or fetch position) will be passed to the application.\n\n If the timeout is reached the internal state will be unknown to the caller\n and this function returns `RD_KAFKA_RESP_ERR__TIMED_OUT`.\n\n If \\p timeout_ms is 0 it will initiate the seek but return\n immediately without any error reporting (e.g., async).\n\n This call will purge all pre-fetched messages for the given partition, which\n may be up to \\c queued.max.message.kbytes in size. Repeated use of seek\n may thus lead to increased network usage as messages are re-fetched from\n the broker.\n\n Individual partition errors are reported in the per-partition \\c .err field\n of \\p partitions.\n\n @remark Seek must only be performed for already assigned/consumed partitions,\n         use rd_kafka_assign() (et.al) to set the initial starting offset\n         for a new assignmenmt.\n\n @returns NULL on success or an error object on failure."]
    pub fn rd_kafka_seek_partitions(
        rk: *mut rd_kafka_t,
        partitions: *mut rd_kafka_topic_partition_list_t,
        timeout_ms: ::std::os::raw::c_int,
    ) -> *mut rd_kafka_error_t;
}
unsafe extern "C" {
    #[doc = " @brief Consume a single message from topic \\p rkt and \\p partition\n\n \\p timeout_ms is maximum amount of time to wait for a message to be received.\n Consumer must have been previously started with `rd_kafka_consume_start()`.\n\n @returns a message object on success or \\c NULL on error.\n The message object must be destroyed with `rd_kafka_message_destroy()`\n when the application is done with it.\n\n Errors (when returning NULL):\n  - ETIMEDOUT - \\p timeout_ms was reached with no new messages fetched.\n  - ENOENT    - \\p rkt + \\p partition is unknown.\n                 (no prior `rd_kafka_consume_start()` call)\n\n NOTE: The returned message's \\c ..->err must be checked for errors.\n NOTE: \\c ..->err \\c == \\c RD_KAFKA_RESP_ERR__PARTITION_EOF signals that the\n       end of the partition has been reached, which should typically not be\n       considered an error. The application should handle this case\n       (e.g., ignore).\n\n @remark on_consume() interceptors may be called from this function prior to\n         passing message to application."]
    pub fn rd_kafka_consume(
        rkt: *mut rd_kafka_topic_t,
        partition: i32,
        timeout_ms: ::std::os::raw::c_int,
    ) -> *mut rd_kafka_message_t;
}
unsafe extern "C" {
    #[doc = " @brief Consume up to \\p rkmessages_size from topic \\p rkt and \\p partition\n        putting a pointer to each message in the application provided\n        array \\p rkmessages (of size \\p rkmessages_size entries).\n\n `rd_kafka_consume_batch()` provides higher throughput performance\n than `rd_kafka_consume()`.\n\n \\p timeout_ms is the maximum amount of time to wait for all of\n \\p rkmessages_size messages to be put into \\p rkmessages.\n If no messages were available within the timeout period this function\n returns 0 and \\p rkmessages remains untouched.\n This differs somewhat from `rd_kafka_consume()`.\n\n The message objects must be destroyed with `rd_kafka_message_destroy()`\n when the application is done with it.\n\n @returns the number of rkmessages added in \\p rkmessages,\n or -1 on error (same error codes as for `rd_kafka_consume()`.\n\n @sa rd_kafka_consume()\n\n @remark on_consume() interceptors may be called from this function prior to\n         passing message to application."]
    pub fn rd_kafka_consume_batch(
        rkt: *mut rd_kafka_topic_t,
        partition: i32,
        timeout_ms: ::std::os::raw::c_int,
        rkmessages: *mut *mut rd_kafka_message_t,
        rkmessages_size: usize,
    ) -> isize;
}
unsafe extern "C" {
    #[doc = " @brief Consumes messages from topic \\p rkt and \\p partition, calling\n the provided callback for each consumed messsage.\n\n `rd_kafka_consume_callback()` provides higher throughput performance\n than both `rd_kafka_consume()` and `rd_kafka_consume_batch()`.\n\n \\p timeout_ms is the maximum amount of time to wait for one or more messages\n to arrive.\n\n The provided \\p consume_cb function is called for each message,\n the application \\b MUST \\b NOT call `rd_kafka_message_destroy()` on the\n provided \\p rkmessage.\n\n The \\p commit_opaque argument is passed to the \\p consume_cb\n as \\p commit_opaque.\n\n @returns the number of messages processed or -1 on error.\n\n @sa rd_kafka_consume()\n\n @remark on_consume() interceptors may be called from this function prior to\n         passing message to application.\n\n @remark This function will return early if a transaction control message is\n         received, these messages are not exposed to the application but\n         still enqueued on the consumer queue to make sure their\n         offsets are stored.\n\n @deprecated This API is deprecated and subject for future removal.\n             There is no new callback-based consume interface, use the\n             poll/queue based alternatives."]
    pub fn rd_kafka_consume_callback(
        rkt: *mut rd_kafka_topic_t,
        partition: i32,
        timeout_ms: ::std::os::raw::c_int,
        consume_cb: ::std::option::Option<
            unsafe extern "C" fn(
                rkmessage: *mut rd_kafka_message_t,
                commit_opaque: *mut ::std::os::raw::c_void,
            ),
        >,
        commit_opaque: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Consume from queue\n\n @sa rd_kafka_consume()"]
    pub fn rd_kafka_consume_queue(
        rkqu: *mut rd_kafka_queue_t,
        timeout_ms: ::std::os::raw::c_int,
    ) -> *mut rd_kafka_message_t;
}
unsafe extern "C" {
    #[doc = " @brief Consume batch of messages from queue\n\n @sa rd_kafka_consume_batch()"]
    pub fn rd_kafka_consume_batch_queue(
        rkqu: *mut rd_kafka_queue_t,
        timeout_ms: ::std::os::raw::c_int,
        rkmessages: *mut *mut rd_kafka_message_t,
        rkmessages_size: usize,
    ) -> isize;
}
unsafe extern "C" {
    #[doc = " @brief Consume multiple messages from queue with callback\n\n @sa rd_kafka_consume_callback()\n\n @deprecated This API is deprecated and subject for future removal.\n             There is no new callback-based consume interface, use the\n             poll/queue based alternatives."]
    pub fn rd_kafka_consume_callback_queue(
        rkqu: *mut rd_kafka_queue_t,
        timeout_ms: ::std::os::raw::c_int,
        consume_cb: ::std::option::Option<
            unsafe extern "C" fn(
                rkmessage: *mut rd_kafka_message_t,
                commit_opaque: *mut ::std::os::raw::c_void,
            ),
        >,
        commit_opaque: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Store offset \\p offset + 1 for topic \\p rkt partition \\p partition.\n\n The \\c offset + 1 will be committed (written) to broker (or file) according\n to \\c `auto.commit.interval.ms` or manual offset-less commit()\n\n @deprecated This API lacks support for partition leader epochs, which makes\n             it at risk for unclean leader election log truncation issues.\n             Use rd_kafka_offsets_store() and rd_kafka_offset_store_message()\n             instead.\n\n @warning This method may only be called for partitions that are currently\n          assigned.\n          Non-assigned partitions will fail with RD_KAFKA_RESP_ERR__STATE.\n          Since v1.9.0.\n\n @warning Avoid storing offsets after calling rd_kafka_seek() (et.al) as\n          this may later interfere with resuming a paused partition, instead\n          store offsets prior to calling seek.\n\n @remark \\c `enable.auto.offset.store` must be set to \"false\" when using\n         this API.\n\n @returns RD_KAFKA_RESP_ERR_NO_ERROR on success or an error code on error."]
    pub fn rd_kafka_offset_store(
        rkt: *mut rd_kafka_topic_t,
        partition: i32,
        offset: i64,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Store offsets for next auto-commit for one or more partitions.\n\n The offset will be committed (written) to the offset store according\n to \\c `auto.commit.interval.ms` or manual offset-less commit().\n\n Per-partition success/error status propagated through each partition's\n \\c .err for all return values (even NO_ERROR) except INVALID_ARG.\n\n @warning This method may only be called for partitions that are currently\n          assigned.\n          Non-assigned partitions will fail with RD_KAFKA_RESP_ERR__STATE.\n          Since v1.9.0.\n\n @warning Avoid storing offsets after calling rd_kafka_seek() (et.al) as\n          this may later interfere with resuming a paused partition, instead\n          store offsets prior to calling seek.\n\n @remark The \\c .offset field is stored as is, it will NOT be + 1.\n\n @remark \\c `enable.auto.offset.store` must be set to \"false\" when using\n         this API.\n\n @remark The leader epoch, if set, will be used to fence outdated partition\n         leaders. See rd_kafka_topic_partition_set_leader_epoch().\n\n @returns RD_KAFKA_RESP_ERR_NO_ERROR on (partial) success, or\n          RD_KAFKA_RESP_ERR__INVALID_ARG if \\c enable.auto.offset.store\n          is true, or\n          RD_KAFKA_RESP_ERR__UNKNOWN_PARTITION or RD_KAFKA_RESP_ERR__STATE\n          if none of the offsets could be stored."]
    pub fn rd_kafka_offsets_store(
        rk: *mut rd_kafka_t,
        offsets: *mut rd_kafka_topic_partition_list_t,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Store offset +1 for the consumed message.\n\n The message offset + 1 will be committed to broker according\n to \\c `auto.commit.interval.ms` or manual offset-less commit()\n\n @warning This method may only be called for partitions that are currently\n          assigned.\n          Non-assigned partitions will fail with RD_KAFKA_RESP_ERR__STATE.\n          Since v1.9.0.\n\n @warning Avoid storing offsets after calling rd_kafka_seek() (et.al) as\n          this may later interfere with resuming a paused partition, instead\n          store offsets prior to calling seek.\n\n @remark \\c `enable.auto.offset.store` must be set to \"false\" when using\n         this API.\n\n @returns NULL on success or an error object on failure."]
    pub fn rd_kafka_offset_store_message(
        rkmessage: *mut rd_kafka_message_t,
    ) -> *mut rd_kafka_error_t;
}
unsafe extern "C" {
    #[doc = " @brief Subscribe to topic set using balanced consumer groups.\n\n Wildcard (regex) topics are supported:\n any topic name in the \\p topics list that is prefixed with \\c \\\"^\\\" will\n be regex-matched to the full list of topics in the cluster and matching\n topics will be added to the subscription list.\n\n The full topic list is retrieved every \\c topic.metadata.refresh.interval.ms\n to pick up new or delete topics that match the subscription.\n If there is any change to the matched topics the consumer will\n immediately rejoin the group with the updated set of subscribed topics.\n\n Regex and full topic names can be mixed in \\p topics.\n\n @remark Only the \\c .topic field is used in the supplied \\p topics list,\n         all other fields are ignored.\n\n @remark subscribe() is an asynchronous method which returns immediately:\n         background threads will (re)join the group, wait for group rebalance,\n         issue any registered rebalance_cb, assign() the assigned partitions,\n         and then start fetching messages. This cycle may take up to\n         \\c session.timeout.ms * 2 or more to complete.\n\n @remark After this call returns a consumer error will be returned by\n         rd_kafka_consumer_poll (et.al) for each unavailable topic in the\n         \\p topics. The error will be RD_KAFKA_RESP_ERR_UNKNOWN_TOPIC_OR_PART\n         for non-existent topics, and\n         RD_KAFKA_RESP_ERR_TOPIC_AUTHORIZATION_FAILED for unauthorized topics.\n         The consumer error will be raised through rd_kafka_consumer_poll()\n         (et.al.) with the \\c rd_kafka_message_t.err field set to one of the\n         error codes mentioned above.\n         The subscribe function itself is asynchronous and will not return\n         an error on unavailable topics.\n\n @returns RD_KAFKA_RESP_ERR_NO_ERROR on success or\n          RD_KAFKA_RESP_ERR__INVALID_ARG if list is empty, contains invalid\n          topics or regexes or duplicate entries,\n          RD_KAFKA_RESP_ERR__FATAL if the consumer has raised a fatal error."]
    pub fn rd_kafka_subscribe(
        rk: *mut rd_kafka_t,
        topics: *const rd_kafka_topic_partition_list_t,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Unsubscribe from the current subscription set."]
    pub fn rd_kafka_unsubscribe(rk: *mut rd_kafka_t) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Returns the current topic subscription\n\n @returns An error code on failure, otherwise \\p topic is updated\n          to point to a newly allocated topic list (possibly empty).\n\n @remark The application is responsible for calling\n         rd_kafka_topic_partition_list_destroy on the returned list."]
    pub fn rd_kafka_subscription(
        rk: *mut rd_kafka_t,
        topics: *mut *mut rd_kafka_topic_partition_list_t,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Poll the consumer for messages or events.\n\n Will block for at most \\p timeout_ms milliseconds.\n\n @remark  An application should make sure to call consumer_poll() at regular\n          intervals, even if no messages are expected, to serve any\n          queued callbacks waiting to be called. This is especially\n          important when a rebalance_cb has been registered as it needs\n          to be called and handled properly to synchronize internal\n          consumer state.\n\n @returns A message object which is a proper message if \\p ->err is\n          RD_KAFKA_RESP_ERR_NO_ERROR, or an event or error for any other\n          value.\n\n @remark on_consume() interceptors may be called from this function prior to\n         passing message to application.\n\n @remark When subscribing to topics the application must call poll at\n         least every \\c max.poll.interval.ms to remain a member of the\n         consumer group.\n\n Noteworthy errors returned in \\c ->err:\n - RD_KAFKA_RESP_ERR__MAX_POLL_EXCEEDED - application failed to call\n   poll within `max.poll.interval.ms`.\n\n @sa rd_kafka_message_t"]
    pub fn rd_kafka_consumer_poll(
        rk: *mut rd_kafka_t,
        timeout_ms: ::std::os::raw::c_int,
    ) -> *mut rd_kafka_message_t;
}
unsafe extern "C" {
    #[doc = " @brief Close the consumer.\n\n This call will block until the consumer has revoked its assignment,\n calling the \\c rebalance_cb if it is configured, committed offsets\n to broker, and left the consumer group (if applicable).\n The maximum blocking time is roughly limited to session.timeout.ms.\n\n @returns An error code indicating if the consumer close was succesful\n          or not.\n          RD_KAFKA_RESP_ERR__FATAL is returned if the consumer has raised\n          a fatal error.\n\n @remark The application still needs to call rd_kafka_destroy() after\n         this call finishes to clean up the underlying handle resources.\n"]
    pub fn rd_kafka_consumer_close(rk: *mut rd_kafka_t) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Asynchronously close the consumer.\n\n Performs the same actions as rd_kafka_consumer_close() but in a\n background thread.\n\n Rebalance events/callbacks (etc) will be forwarded to the\n application-provided \\p rkqu. The application must poll/serve this queue\n until rd_kafka_consumer_closed() returns true.\n\n @remark Depending on consumer group join state there may or may not be\n         rebalance events emitted on \\p rkqu.\n\n @returns an error object if the consumer close failed, else NULL.\n\n @sa rd_kafka_consumer_closed()"]
    pub fn rd_kafka_consumer_close_queue(
        rk: *mut rd_kafka_t,
        rkqu: *mut rd_kafka_queue_t,
    ) -> *mut rd_kafka_error_t;
}
unsafe extern "C" {
    #[doc = " @returns 1 if the consumer is closed, else 0.\n\n Should be used in conjunction with rd_kafka_consumer_close_queue() to know\n when the consumer has been closed.\n\n @sa rd_kafka_consumer_close_queue()"]
    pub fn rd_kafka_consumer_closed(rk: *mut rd_kafka_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Incrementally add \\p partitions to the current assignment.\n\n If a COOPERATIVE assignor (i.e. incremental rebalancing) is being used,\n this method should be used in a rebalance callback to adjust the current\n assignment appropriately in the case where the rebalance type is\n RD_KAFKA_RESP_ERR__ASSIGN_PARTITIONS. The application must pass the\n partition list passed to the callback (or a copy of it), even if the\n list is empty. \\p partitions must not be NULL. This method may also be\n used outside the context of a rebalance callback.\n\n @returns NULL on success, or an error object if the operation was\n          unsuccessful.\n\n @remark The returned error object (if not NULL) must be destroyed with\n         rd_kafka_error_destroy()."]
    pub fn rd_kafka_incremental_assign(
        rk: *mut rd_kafka_t,
        partitions: *const rd_kafka_topic_partition_list_t,
    ) -> *mut rd_kafka_error_t;
}
unsafe extern "C" {
    #[doc = " @brief Incrementally remove \\p partitions from the current assignment.\n\n If a COOPERATIVE assignor (i.e. incremental rebalancing) is being used,\n this method should be used in a rebalance callback to adjust the current\n assignment appropriately in the case where the rebalance type is\n RD_KAFKA_RESP_ERR__REVOKE_PARTITIONS. The application must pass the\n partition list passed to the callback (or a copy of it), even if the\n list is empty. \\p partitions must not be NULL. This method may also be\n used outside the context of a rebalance callback.\n\n @returns NULL on success, or an error object if the operation was\n          unsuccessful.\n\n @remark The returned error object (if not NULL) must be destroyed with\n         rd_kafka_error_destroy()."]
    pub fn rd_kafka_incremental_unassign(
        rk: *mut rd_kafka_t,
        partitions: *const rd_kafka_topic_partition_list_t,
    ) -> *mut rd_kafka_error_t;
}
unsafe extern "C" {
    #[doc = " @brief The rebalance protocol currently in use. This will be\n        \"NONE\" if the consumer has not (yet) joined a group, else it will\n        match the rebalance protocol (\"EAGER\", \"COOPERATIVE\") of the\n        configured and selected assignor(s). All configured\n        assignors must have the same protocol type, meaning\n        online migration of a consumer group from using one\n        protocol to another (in particular upgading from EAGER\n        to COOPERATIVE) without a restart is not currently\n        supported.\n\n @returns NULL on error, or one of \"NONE\", \"EAGER\", \"COOPERATIVE\" on success."]
    pub fn rd_kafka_rebalance_protocol(rk: *mut rd_kafka_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " @brief Atomic assignment of partitions to consume.\n\n The new \\p partitions will replace the existing assignment.\n\n A zero-length \\p partitions will treat the partitions as a valid,\n albeit empty assignment, and maintain internal state, while a \\c NULL\n value for \\p partitions will reset and clear the internal state.\n\n When used from a rebalance callback, the application should pass the\n partition list passed to the callback (or a copy of it) even if the list\n is empty (i.e. should not pass NULL in this case) so as to maintain\n internal join state. This is not strictly required - the application\n may adjust the assignment provided by the group. However, this is rarely\n useful in practice.\n\n @returns An error code indicating if the new assignment was applied or not.\n          RD_KAFKA_RESP_ERR__FATAL is returned if the consumer has raised\n          a fatal error."]
    pub fn rd_kafka_assign(
        rk: *mut rd_kafka_t,
        partitions: *const rd_kafka_topic_partition_list_t,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Returns the current partition assignment as set by rd_kafka_assign()\n        or rd_kafka_incremental_assign().\n\n @returns An error code on failure, otherwise \\p partitions is updated\n          to point to a newly allocated partition list (possibly empty).\n\n @remark The application is responsible for calling\n         rd_kafka_topic_partition_list_destroy on the returned list.\n\n @remark This assignment represents the partitions assigned through the\n         assign functions and not the partitions assigned to this consumer\n         instance by the consumer group leader.\n         They are usually the same following a rebalance but not necessarily\n         since an application is free to assign any partitions."]
    pub fn rd_kafka_assignment(
        rk: *mut rd_kafka_t,
        partitions: *mut *mut rd_kafka_topic_partition_list_t,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Check whether the consumer considers the current assignment to\n        have been lost involuntarily. This method is only applicable for\n        use with a high level subscribing consumer. Assignments are revoked\n        immediately when determined to have been lost, so this method\n        is only useful when reacting to a RD_KAFKA_EVENT_REBALANCE event\n        or from within a rebalance_cb. Partitions that have been lost may\n        already be owned by other members in the group and therefore\n        commiting offsets, for example, may fail.\n\n @remark Calling rd_kafka_assign(), rd_kafka_incremental_assign() or\n         rd_kafka_incremental_unassign() resets this flag.\n\n @returns Returns 1 if the current partition assignment is considered\n          lost, 0 otherwise."]
    pub fn rd_kafka_assignment_lost(rk: *mut rd_kafka_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Commit offsets on broker for the provided list of partitions.\n\n \\p offsets should contain \\c topic, \\c partition, \\c offset and possibly\n \\c metadata. The \\c offset should be the offset where consumption will\n resume, i.e., the last processed offset + 1.\n If \\p offsets is NULL the current partition assignment will be used instead.\n\n If \\p async is false this operation will block until the broker offset commit\n is done, returning the resulting success or error code.\n\n If a rd_kafka_conf_set_offset_commit_cb() offset commit callback has been\n configured the callback will be enqueued for a future call to\n rd_kafka_poll(), rd_kafka_consumer_poll() or similar.\n\n @returns An error code indiciating if the commit was successful,\n          or successfully scheduled if asynchronous, or failed.\n          RD_KAFKA_RESP_ERR__FATAL is returned if the consumer has raised\n          a fatal error.\n\n          FIXME: Update below documentation.\n\n          RD_KAFKA_RESP_ERR_STALE_MEMBER_EPOCH is returned, when\n          using `group.protocol=consumer`, if the commit failed because the\n          member has switched to a new member epoch.\n          This error code can be retried.\n          Partition level error is also set in the \\p offsets.\n\n          RD_KAFKA_RESP_ERR_UNKNOWN_MEMBER_ID is returned, when\n          using `group.protocol=consumer`, if the member has been\n          removed from the consumer group\n          This error code is permanent, uncommitted messages will be\n          reprocessed by this or a different member and committed there.\n          Partition level error is also set in the \\p offsets."]
    pub fn rd_kafka_commit(
        rk: *mut rd_kafka_t,
        offsets: *const rd_kafka_topic_partition_list_t,
        async_: ::std::os::raw::c_int,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Commit message's offset on broker for the message's partition.\n        The committed offset is the message's offset + 1.\n\n @sa rd_kafka_commit"]
    pub fn rd_kafka_commit_message(
        rk: *mut rd_kafka_t,
        rkmessage: *const rd_kafka_message_t,
        async_: ::std::os::raw::c_int,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Commit offsets on broker for the provided list of partitions.\n\n See rd_kafka_commit for \\p offsets semantics.\n\n The result of the offset commit will be posted on the provided \\p rkqu queue.\n\n If the application uses one of the poll APIs (rd_kafka_poll(),\n rd_kafka_consumer_poll(), rd_kafka_queue_poll(), ..) to serve the queue\n the \\p cb callback is required.\n\n The \\p commit_opaque argument is passed to the callback as \\p commit_opaque,\n or if using the event API the callback is ignored and the offset commit\n result will be returned as an RD_KAFKA_EVENT_COMMIT event and the\n \\p commit_opaque value will be available with rd_kafka_event_opaque().\n\n If \\p rkqu is NULL a temporary queue will be created and the callback will\n be served by this call.\n\n @sa rd_kafka_commit()\n @sa rd_kafka_conf_set_offset_commit_cb()"]
    pub fn rd_kafka_commit_queue(
        rk: *mut rd_kafka_t,
        offsets: *const rd_kafka_topic_partition_list_t,
        rkqu: *mut rd_kafka_queue_t,
        cb: ::std::option::Option<
            unsafe extern "C" fn(
                rk: *mut rd_kafka_t,
                err: rd_kafka_resp_err_t,
                offsets: *mut rd_kafka_topic_partition_list_t,
                commit_opaque: *mut ::std::os::raw::c_void,
            ),
        >,
        commit_opaque: *mut ::std::os::raw::c_void,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Retrieve committed offsets for topics+partitions.\n\n The \\p offset field of each requested partition will either be set to\n stored offset or to RD_KAFKA_OFFSET_INVALID in case there was no stored\n offset for that partition.\n\n Committed offsets will be returned according to the `isolation.level`\n configuration property, if set to `read_committed` (default) then only\n stable offsets for fully committed transactions will be returned, while\n `read_uncommitted` may return offsets for not yet committed transactions.\n\n @returns RD_KAFKA_RESP_ERR_NO_ERROR on success in which case the\n          \\p offset or \\p err field of each \\p partitions' element is filled\n          in with the stored offset, or a partition specific error.\n          Else returns an error code."]
    pub fn rd_kafka_committed(
        rk: *mut rd_kafka_t,
        partitions: *mut rd_kafka_topic_partition_list_t,
        timeout_ms: ::std::os::raw::c_int,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Retrieve current positions (offsets) for topics+partitions.\n\n The \\p offset field of each requested partition will be set to the offset\n of the last consumed message + 1, or RD_KAFKA_OFFSET_INVALID in case there\n was no previous message.\n\n @remark  In this context the last consumed message is the offset consumed\n          by the current librdkafka instance and, in case of rebalancing, not\n          necessarily the last message fetched from the partition.\n\n @returns RD_KAFKA_RESP_ERR_NO_ERROR on success in which case the\n          \\p offset or \\p err field of each \\p partitions' element is filled\n          in with the stored offset, or a partition specific error.\n          Else returns an error code."]
    pub fn rd_kafka_position(
        rk: *mut rd_kafka_t,
        partitions: *mut rd_kafka_topic_partition_list_t,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @returns the current consumer group metadata associated with this consumer,\n          or NULL if \\p rk is not a consumer configured with a \\c group.id.\n          This metadata object should be passed to the transactional\n          producer's rd_kafka_send_offsets_to_transaction() API.\n\n @remark The returned pointer must be freed by the application using\n         rd_kafka_consumer_group_metadata_destroy().\n\n @sa rd_kafka_send_offsets_to_transaction()"]
    pub fn rd_kafka_consumer_group_metadata(
        rk: *mut rd_kafka_t,
    ) -> *mut rd_kafka_consumer_group_metadata_t;
}
unsafe extern "C" {
    #[doc = " @brief Create a new consumer group metadata object.\n        This is typically only used for writing tests.\n\n @param group_id The group id.\n\n @remark The returned pointer must be freed by the application using\n         rd_kafka_consumer_group_metadata_destroy()."]
    pub fn rd_kafka_consumer_group_metadata_new(
        group_id: *const ::std::os::raw::c_char,
    ) -> *mut rd_kafka_consumer_group_metadata_t;
}
unsafe extern "C" {
    #[doc = " @brief Create a new consumer group metadata object.\n        This is typically only used for writing tests.\n\n @param group_id The group id.\n @param generation_id The group generation id.\n @param member_id The group member id.\n @param group_instance_id The group instance id (may be NULL).\n\n @remark The returned pointer must be freed by the application using\n         rd_kafka_consumer_group_metadata_destroy()."]
    pub fn rd_kafka_consumer_group_metadata_new_with_genid(
        group_id: *const ::std::os::raw::c_char,
        generation_id: i32,
        member_id: *const ::std::os::raw::c_char,
        group_instance_id: *const ::std::os::raw::c_char,
    ) -> *mut rd_kafka_consumer_group_metadata_t;
}
unsafe extern "C" {
    #[doc = " @brief Get group id of a group metadata.\n\n @param group_metadata The group metadata.\n\n @returns The group id contained in the passed \\p group_metadata.\n\n @remark The returned pointer has the same lifetime as \\p group_metadata."]
    pub fn rd_kafka_consumer_group_metadata_group_id(
        group_metadata: *const rd_kafka_consumer_group_metadata_t,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " @brief Get group instance id of a group metadata.\n\n @param group_metadata The group metadata.\n\n @returns The group instance id contained in the passed \\p group_metadata\n          or NULL.\n\n @remark The returned pointer has the same lifetime as \\p group_metadata."]
    pub fn rd_kafka_consumer_group_metadata_group_instance_id(
        group_metadata: *const rd_kafka_consumer_group_metadata_t,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " @brief Get member id of a group metadata.\n\n @param group_metadata The group metadata.\n\n @returns The member id contained in the passed \\p group_metadata.\n\n @remark The returned pointer has the same lifetime as \\p group_metadata."]
    pub fn rd_kafka_consumer_group_metadata_member_id(
        group_metadata: *const rd_kafka_consumer_group_metadata_t,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " @brief Get the generation id (classic protocol)\n        or member epoch (consumer protocol) of a group metadata.\n\n @param group_metadata The group metadata.\n\n @returns The generation id or member epoch\n          contained in the passed \\p group_metadata."]
    pub fn rd_kafka_consumer_group_metadata_generation_id(
        group_metadata: *const rd_kafka_consumer_group_metadata_t,
    ) -> i32;
}
unsafe extern "C" {
    #[doc = " @brief Frees the consumer group metadata object as returned by\n        rd_kafka_consumer_group_metadata()."]
    pub fn rd_kafka_consumer_group_metadata_destroy(arg1: *mut rd_kafka_consumer_group_metadata_t);
}
unsafe extern "C" {
    #[doc = " @brief Serialize the consumer group metadata to a binary format.\n        This is mainly for client binding use and not for application use.\n\n @remark The serialized metadata format is private and is not compatible\n         across different versions or even builds of librdkafka.\n         It should only be used in the same process runtime and must only\n         be passed to rd_kafka_consumer_group_metadata_read().\n\n @param cgmd Metadata to be serialized.\n @param bufferp On success this pointer will be updated to point to na\n                allocated buffer containing the serialized metadata.\n                The buffer must be freed with rd_kafka_mem_free().\n @param sizep The pointed to size will be updated with the size of\n              the serialized buffer.\n\n @returns NULL on success or an error object on failure.\n\n @sa rd_kafka_consumer_group_metadata_read()"]
    pub fn rd_kafka_consumer_group_metadata_write(
        cgmd: *const rd_kafka_consumer_group_metadata_t,
        bufferp: *mut *mut ::std::os::raw::c_void,
        sizep: *mut usize,
    ) -> *mut rd_kafka_error_t;
}
unsafe extern "C" {
    #[doc = " @brief Reads serialized consumer group metadata and returns a\n        consumer group metadata object.\n        This is mainly for client binding use and not for application use.\n\n @remark The serialized metadata format is private and is not compatible\n         across different versions or even builds of librdkafka.\n         It should only be used in the same process runtime and must only\n         be passed to rd_kafka_consumer_group_metadata_read().\n\n @param cgmdp On success this pointer will be updated to point to a new\n              consumer group metadata object which must be freed with\n              rd_kafka_consumer_group_metadata_destroy().\n @param buffer Pointer to the serialized data.\n @param size Size of the serialized data.\n\n @returns NULL on success or an error object on failure.\n\n @sa rd_kafka_consumer_group_metadata_write()"]
    pub fn rd_kafka_consumer_group_metadata_read(
        cgmdp: *mut *mut rd_kafka_consumer_group_metadata_t,
        buffer: *const ::std::os::raw::c_void,
        size: usize,
    ) -> *mut rd_kafka_error_t;
}
unsafe extern "C" {
    #[doc = " @brief Produce and send a single message to broker.\n\n \\p rkt is the target topic which must have been previously created with\n `rd_kafka_topic_new()`.\n\n `rd_kafka_produce()` is an asynchronous non-blocking API.\n See `rd_kafka_conf_set_dr_msg_cb` on how to setup a callback to be called\n once the delivery status (success or failure) is known. The delivery report\n is triggered by the application calling `rd_kafka_poll()` (at regular\n intervals) or `rd_kafka_flush()` (at termination).\n\n Since producing is asynchronous, you should call `rd_kafka_flush()` before\n you destroy the producer. Otherwise, any outstanding messages will be\n silently discarded.\n\n When temporary errors occur, librdkafka automatically retries to produce the\n messages. Retries are triggered after retry.backoff.ms and when the\n leader broker for the given partition is available. Otherwise, librdkafka\n falls back to polling the topic metadata to monitor when a new leader is\n elected (see the topic.metadata.refresh.fast.interval.ms and\n topic.metadata.refresh.interval.ms configurations) and then performs a\n retry. A delivery error will occur if the message could not be produced\n within message.timeout.ms.\n\n See the \"Message reliability\" chapter in INTRODUCTION.md for more\n information.\n\n \\p partition is the target partition, either:\n   - RD_KAFKA_PARTITION_UA (unassigned) for\n     automatic partitioning using the topic's partitioner function, or\n   - a fixed partition (0..N)\n\n \\p msgflags is zero or more of the following flags OR:ed together:\n    RD_KAFKA_MSG_F_BLOCK - block \\p produce*() call if\n                           \\p queue.buffering.max.messages or\n                           \\p queue.buffering.max.kbytes are exceeded.\n                           Messages are considered in-queue from the point\n they are accepted by produce() until their corresponding delivery report\n callback/event returns. It is thus a requirement to call rd_kafka_poll() (or\n equiv.) from a separate thread when F_BLOCK is used. See WARNING on \\c\n RD_KAFKA_MSG_F_BLOCK above.\n\n    RD_KAFKA_MSG_F_FREE - rdkafka will free(3) \\p payload when it is done\n                          with it.\n    RD_KAFKA_MSG_F_COPY - the \\p payload data will be copied and the\n                          \\p payload pointer will not be used by rdkafka\n                          after the call returns.\n    RD_KAFKA_MSG_F_PARTITION - produce_batch() will honour per-message\n                               partition, either set manually or by the\n                               configured partitioner.\n\n    .._F_FREE and .._F_COPY are mutually exclusive. If neither of these are\n    set, the caller must ensure that the memory backing \\p payload remains\n    valid and is not modified or reused until the delivery callback is\n    invoked. Other buffers passed to `rd_kafka_produce()` don't have this\n    restriction on reuse, i.e. the memory backing the key or the topic name\n    may be reused as soon as `rd_kafka_produce()` returns.\n\n    If the function returns -1 and RD_KAFKA_MSG_F_FREE was specified, then\n    the memory associated with the payload is still the caller's\n    responsibility.\n\n \\p payload is the message payload of size \\p len bytes.\n\n \\p key is an optional message key of size \\p keylen bytes, if non-NULL it\n will be passed to the topic partitioner as well as be sent with the\n message to the broker and passed on to the consumer.\n\n \\p msg_opaque is an optional application-provided per-message opaque\n pointer that will provided in the message's delivery report callback\n (\\c dr_msg_cb or \\c dr_cb) and the \\c rd_kafka_message_t \\c _private field.\n\n @remark on_send() and on_acknowledgement() interceptors may be called\n         from this function. on_acknowledgement() will only be called if the\n         message fails partitioning.\n\n @remark If the producer is transactional (\\c transactional.id is configured)\n         producing is only allowed during an on-going transaction, namely\n         after rd_kafka_begin_transaction() has been called.\n\n @returns 0 on success or -1 on error in which case errno is set accordingly:\n  - ENOBUFS  - maximum number of outstanding messages has been reached:\n               \"queue.buffering.max.messages\"\n               (RD_KAFKA_RESP_ERR__QUEUE_FULL)\n  - EMSGSIZE - message is larger than configured max size:\n               \"messages.max.bytes\".\n               (RD_KAFKA_RESP_ERR_MSG_SIZE_TOO_LARGE)\n  - ESRCH    - requested \\p partition is unknown in the Kafka cluster.\n               (RD_KAFKA_RESP_ERR__UNKNOWN_PARTITION)\n  - ENOENT   - topic is unknown in the Kafka cluster.\n               (RD_KAFKA_RESP_ERR__UNKNOWN_TOPIC)\n  - ECANCELED - fatal error has been raised on producer, see\n                rd_kafka_fatal_error(),\n               (RD_KAFKA_RESP_ERR__FATAL).\n  - ENOEXEC  - transactional state forbids producing\n               (RD_KAFKA_RESP_ERR__STATE)\n\n @sa Use rd_kafka_errno2err() to convert `errno` to rdkafka error code."]
    pub fn rd_kafka_produce(
        rkt: *mut rd_kafka_topic_t,
        partition: i32,
        msgflags: ::std::os::raw::c_int,
        payload: *mut ::std::os::raw::c_void,
        len: usize,
        key: *const ::std::os::raw::c_void,
        keylen: usize,
        msg_opaque: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Produce and send a single message to broker.\n\n The message is defined by a va-arg list using \\c rd_kafka_vtype_t\n tag tuples which must be terminated with a single \\c RD_KAFKA_V_END.\n\n @returns \\c RD_KAFKA_RESP_ERR_NO_ERROR on success, else an error code as\n          described in rd_kafka_produce().\n          \\c RD_KAFKA_RESP_ERR__CONFLICT is returned if _V_HEADER and\n          _V_HEADERS are mixed.\n\n @sa rd_kafka_produce, rd_kafka_produceva, RD_KAFKA_V_END"]
    pub fn rd_kafka_producev(rk: *mut rd_kafka_t, ...) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Produce and send a single message to broker.\n\n The message is defined by an array of \\c rd_kafka_vu_t of\n count \\p cnt.\n\n @returns an error object on failure or NULL on success.\n          See rd_kafka_producev() for specific error codes.\n\n @sa rd_kafka_produce, rd_kafka_producev, RD_KAFKA_V_END"]
    pub fn rd_kafka_produceva(
        rk: *mut rd_kafka_t,
        vus: *const rd_kafka_vu_t,
        cnt: usize,
    ) -> *mut rd_kafka_error_t;
}
unsafe extern "C" {
    #[doc = " @brief Produce multiple messages.\n\n If partition is RD_KAFKA_PARTITION_UA the configured partitioner will\n be run for each message (slower), otherwise the messages will be enqueued\n to the specified partition directly (faster).\n\n The messages are provided in the array \\p rkmessages of count \\p message_cnt\n elements.\n The \\p partition and \\p msgflags are used for all provided messages.\n\n Honoured \\p rkmessages[] fields are:\n  - payload,len    Message payload and length\n  - key,key_len    Optional message key\n  - _private       Message opaque pointer (msg_opaque)\n  - err            Will be set according to success or failure, see\n                   rd_kafka_produce() for possible error codes.\n                   Application only needs to check for errors if\n                   return value != \\p message_cnt.\n\n @remark If \\c RD_KAFKA_MSG_F_PARTITION is set in \\p msgflags, the\n         \\c .partition field of the \\p rkmessages is used instead of\n         \\p partition.\n\n @returns the number of messages succesfully enqueued for producing.\n\n @remark This interface does NOT support setting message headers on\n         the provided \\p rkmessages."]
    pub fn rd_kafka_produce_batch(
        rkt: *mut rd_kafka_topic_t,
        partition: i32,
        msgflags: ::std::os::raw::c_int,
        rkmessages: *mut rd_kafka_message_t,
        message_cnt: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Wait until all outstanding produce requests, et.al, are completed.\n        This should typically be done prior to destroying a producer instance\n        to make sure all queued and in-flight produce requests are completed\n        before terminating.\n\n @remark This function will call rd_kafka_poll() and thus trigger callbacks.\n\n @remark The \\c linger.ms time will be ignored for the duration of the call,\n         queued messages will be sent to the broker as soon as possible.\n\n @remark If RD_KAFKA_EVENT_DR has been enabled\n         (through rd_kafka_conf_set_events()) this function will not call\n         rd_kafka_poll() but instead wait for the librdkafka-handled\n         message count to reach zero. This requires the application to\n         serve the event queue in a separate thread.\n         In this mode only messages are counted, not other types of\n         queued events.\n\n @returns RD_KAFKA_RESP_ERR__TIMED_OUT if \\p timeout_ms was reached before all\n          outstanding requests were completed, else RD_KAFKA_RESP_ERR_NO_ERROR\n\n @sa rd_kafka_outq_len()"]
    pub fn rd_kafka_flush(
        rk: *mut rd_kafka_t,
        timeout_ms: ::std::os::raw::c_int,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Purge messages currently handled by the producer instance.\n\n @param rk          Client instance.\n @param purge_flags Tells which messages to purge and how.\n\n The application will need to call rd_kafka_poll() or rd_kafka_flush()\n afterwards to serve the delivery report callbacks of the purged messages.\n\n Messages purged from internal queues fail with the delivery report\n error code set to RD_KAFKA_RESP_ERR__PURGE_QUEUE, while purged messages that\n are in-flight to or from the broker will fail with the error code set to\n RD_KAFKA_RESP_ERR__PURGE_INFLIGHT.\n\n @warning Purging messages that are in-flight to or from the broker\n          will ignore any subsequent acknowledgement for these messages\n          received from the broker, effectively making it impossible\n          for the application to know if the messages were successfully\n          produced or not. This may result in duplicate messages if the\n          application retries these messages at a later time.\n\n @remark This call may block for a short time while background thread\n         queues are purged.\n\n @returns RD_KAFKA_RESP_ERR_NO_ERROR on success,\n          RD_KAFKA_RESP_ERR__INVALID_ARG if the \\p purge flags are invalid\n          or unknown,\n          RD_KAFKA_RESP_ERR__NOT_IMPLEMENTED if called on a non-producer\n          client instance."]
    pub fn rd_kafka_purge(
        rk: *mut rd_kafka_t,
        purge_flags: ::std::os::raw::c_int,
    ) -> rd_kafka_resp_err_t;
}
#[doc = " @brief Broker information"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rd_kafka_metadata_broker {
    #[doc = "< Broker Id"]
    pub id: i32,
    #[doc = "< Broker hostname"]
    pub host: *mut ::std::os::raw::c_char,
    #[doc = "< Broker listening port"]
    pub port: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rd_kafka_metadata_broker"]
        [::std::mem::size_of::<rd_kafka_metadata_broker>() - 24usize];
    ["Alignment of rd_kafka_metadata_broker"]
        [::std::mem::align_of::<rd_kafka_metadata_broker>() - 8usize];
    ["Offset of field: rd_kafka_metadata_broker::id"]
        [::std::mem::offset_of!(rd_kafka_metadata_broker, id) - 0usize];
    ["Offset of field: rd_kafka_metadata_broker::host"]
        [::std::mem::offset_of!(rd_kafka_metadata_broker, host) - 8usize];
    ["Offset of field: rd_kafka_metadata_broker::port"]
        [::std::mem::offset_of!(rd_kafka_metadata_broker, port) - 16usize];
};
#[doc = " @brief Broker information"]
pub type rd_kafka_metadata_broker_t = rd_kafka_metadata_broker;
#[doc = " @brief Partition information"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rd_kafka_metadata_partition {
    #[doc = "< Partition Id"]
    pub id: i32,
    #[doc = "< Partition error reported by broker"]
    pub err: rd_kafka_resp_err_t,
    #[doc = "< Leader broker"]
    pub leader: i32,
    #[doc = "< Number of brokers in \\p replicas"]
    pub replica_cnt: ::std::os::raw::c_int,
    #[doc = "< Replica brokers"]
    pub replicas: *mut i32,
    #[doc = "< Number of ISR brokers in \\p isrs"]
    pub isr_cnt: ::std::os::raw::c_int,
    #[doc = "< In-Sync-Replica brokers"]
    pub isrs: *mut i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rd_kafka_metadata_partition"]
        [::std::mem::size_of::<rd_kafka_metadata_partition>() - 40usize];
    ["Alignment of rd_kafka_metadata_partition"]
        [::std::mem::align_of::<rd_kafka_metadata_partition>() - 8usize];
    ["Offset of field: rd_kafka_metadata_partition::id"]
        [::std::mem::offset_of!(rd_kafka_metadata_partition, id) - 0usize];
    ["Offset of field: rd_kafka_metadata_partition::err"]
        [::std::mem::offset_of!(rd_kafka_metadata_partition, err) - 4usize];
    ["Offset of field: rd_kafka_metadata_partition::leader"]
        [::std::mem::offset_of!(rd_kafka_metadata_partition, leader) - 8usize];
    ["Offset of field: rd_kafka_metadata_partition::replica_cnt"]
        [::std::mem::offset_of!(rd_kafka_metadata_partition, replica_cnt) - 12usize];
    ["Offset of field: rd_kafka_metadata_partition::replicas"]
        [::std::mem::offset_of!(rd_kafka_metadata_partition, replicas) - 16usize];
    ["Offset of field: rd_kafka_metadata_partition::isr_cnt"]
        [::std::mem::offset_of!(rd_kafka_metadata_partition, isr_cnt) - 24usize];
    ["Offset of field: rd_kafka_metadata_partition::isrs"]
        [::std::mem::offset_of!(rd_kafka_metadata_partition, isrs) - 32usize];
};
#[doc = " @brief Partition information"]
pub type rd_kafka_metadata_partition_t = rd_kafka_metadata_partition;
#[doc = " @brief Topic information"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rd_kafka_metadata_topic {
    #[doc = "< Topic name"]
    pub topic: *mut ::std::os::raw::c_char,
    #[doc = "< Number of partitions in \\p partitions"]
    pub partition_cnt: ::std::os::raw::c_int,
    #[doc = "< Partitions"]
    pub partitions: *mut rd_kafka_metadata_partition,
    #[doc = "< Topic error reported by broker"]
    pub err: rd_kafka_resp_err_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rd_kafka_metadata_topic"][::std::mem::size_of::<rd_kafka_metadata_topic>() - 32usize];
    ["Alignment of rd_kafka_metadata_topic"]
        [::std::mem::align_of::<rd_kafka_metadata_topic>() - 8usize];
    ["Offset of field: rd_kafka_metadata_topic::topic"]
        [::std::mem::offset_of!(rd_kafka_metadata_topic, topic) - 0usize];
    ["Offset of field: rd_kafka_metadata_topic::partition_cnt"]
        [::std::mem::offset_of!(rd_kafka_metadata_topic, partition_cnt) - 8usize];
    ["Offset of field: rd_kafka_metadata_topic::partitions"]
        [::std::mem::offset_of!(rd_kafka_metadata_topic, partitions) - 16usize];
    ["Offset of field: rd_kafka_metadata_topic::err"]
        [::std::mem::offset_of!(rd_kafka_metadata_topic, err) - 24usize];
};
#[doc = " @brief Topic information"]
pub type rd_kafka_metadata_topic_t = rd_kafka_metadata_topic;
#[doc = " @brief Metadata container"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rd_kafka_metadata {
    #[doc = "< Number of brokers in \\p brokers"]
    pub broker_cnt: ::std::os::raw::c_int,
    #[doc = "< Brokers"]
    pub brokers: *mut rd_kafka_metadata_broker,
    #[doc = "< Number of topics in \\p topics"]
    pub topic_cnt: ::std::os::raw::c_int,
    #[doc = "< Topics"]
    pub topics: *mut rd_kafka_metadata_topic,
    #[doc = "< Broker originating this metadata"]
    pub orig_broker_id: i32,
    #[doc = "< Name of originating broker"]
    pub orig_broker_name: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rd_kafka_metadata"][::std::mem::size_of::<rd_kafka_metadata>() - 48usize];
    ["Alignment of rd_kafka_metadata"][::std::mem::align_of::<rd_kafka_metadata>() - 8usize];
    ["Offset of field: rd_kafka_metadata::broker_cnt"]
        [::std::mem::offset_of!(rd_kafka_metadata, broker_cnt) - 0usize];
    ["Offset of field: rd_kafka_metadata::brokers"]
        [::std::mem::offset_of!(rd_kafka_metadata, brokers) - 8usize];
    ["Offset of field: rd_kafka_metadata::topic_cnt"]
        [::std::mem::offset_of!(rd_kafka_metadata, topic_cnt) - 16usize];
    ["Offset of field: rd_kafka_metadata::topics"]
        [::std::mem::offset_of!(rd_kafka_metadata, topics) - 24usize];
    ["Offset of field: rd_kafka_metadata::orig_broker_id"]
        [::std::mem::offset_of!(rd_kafka_metadata, orig_broker_id) - 32usize];
    ["Offset of field: rd_kafka_metadata::orig_broker_name"]
        [::std::mem::offset_of!(rd_kafka_metadata, orig_broker_name) - 40usize];
};
#[doc = " @brief Metadata container"]
pub type rd_kafka_metadata_t = rd_kafka_metadata;
unsafe extern "C" {
    #[doc = " @brief Request Metadata from broker.\n\n Parameters:\n  - \\p all_topics  if non-zero: request info about all topics in cluster,\n                   if zero: only request info about locally known topics.\n  - \\p only_rkt    only request info about this topic\n  - \\p metadatap   pointer to hold metadata result.\n                   The \\p *metadatap pointer must be released\n                   with rd_kafka_metadata_destroy().\n  - \\p timeout_ms  maximum response time before failing.\n\n @remark Consumer: If \\p all_topics is non-zero the Metadata response\n         information may trigger a re-join if any subscribed topics\n         have changed partition count or existence state.\n\n @returns RD_KAFKA_RESP_ERR_NO_ERROR on success (in which case *metadatap)\n          will be set, else RD_KAFKA_RESP_ERR__TIMED_OUT on timeout or\n          other error code on error."]
    pub fn rd_kafka_metadata(
        rk: *mut rd_kafka_t,
        all_topics: ::std::os::raw::c_int,
        only_rkt: *mut rd_kafka_topic_t,
        metadatap: *mut *const rd_kafka_metadata,
        timeout_ms: ::std::os::raw::c_int,
    ) -> rd_kafka_resp_err_t;
}
unsafe extern "C" {
    #[doc = " @brief Release metadata memory."]
    pub fn rd_kafka_metadata_destroy(metadata: *const rd_kafka_metadata);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rd_kafka_Node_s {
    _unused: [u8; 0],
}
#[doc = " @brief Node (broker) information."]
pub type rd_kafka_Node_t = rd_kafka_Node_s;
unsafe extern "C" {
    #[doc = " @brief Get the id of \\p node.\n\n @param node The Node instance.\n\n @return The node id."]
    pub fn rd_kafka_Node_id(node: *const rd_kafka_Node_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " @brief Get the host of \\p node.\n\n @param node The Node instance.\n\n @return The node host.\n\n @remark The lifetime of the returned memory is the same\n         as the lifetime of the \\p node object."]
    pub fn rd_kafka_Node_host(node: *const rd_kafka_Node_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " @brief Get the port of \\p node.\n\n @param node The Node instance.\n\n @return The node port."]
    pub fn rd_kafka_Node_port(node: *const rd_kafka_Node_t) -> u16;
}
unsafe extern "C" {
    #[doc = " @brief Get the rack of \\p node.\n\n @param node The Node instance\n\n @return The node rack id. May be NULL."]
    pub fn rd_kafka_Node_rack(node: *const rd_kafka_Node_t) -> *const ::std::os::raw::c_char;
}
#[doc = " @brief Group member information\n\n For more information on \\p member_metadata format, see\n https://cwiki.apache.org/confluence/display/KAFKA/A+Guide+To+The+Kafka+Protocol#AGuideToTheKafkaProtocol-GroupMembershipAPI\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rd_kafka_group_member_info {
    #[doc = "< Member id (generated by broker)"]
    pub member_id: *mut ::std::os::raw::c_char,
    #[doc = "< Client's \\p client.id"]
    pub client_id: *mut ::std::os::raw::c_char,
    #[doc = "< Client's hostname"]
    pub client_host: *mut ::std::os::raw::c_char,
    #[doc = "< Member metadata (binary),\n   format depends on \\p protocol_type."]
    pub member_metadata: *mut ::std::os::raw::c_void,
    #[doc = "< Member metadata size in bytes"]
    pub member_metadata_size: ::std::os::raw::c_int,
    #[doc = "< Member assignment (binary),\n    format depends on \\p protocol_type."]
    pub member_assignment: *mut ::std::os::raw::c_void,
    #[doc = "< Member assignment size in bytes"]
    pub member_assignment_size: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rd_kafka_group_member_info"]
        [::std::mem::size_of::<rd_kafka_group_member_info>() - 56usize];
    ["Alignment of rd_kafka_group_member_info"]
        [::std::mem::align_of::<rd_kafka_group_member_info>() - 8usize];
    ["Offset of field: rd_kafka_group_member_info::member_id"]
        [::std::mem::offset_of!(rd_kafka_group_member_info, member_id) - 0usize];
    ["Offset of field: rd_kafka_group_member_info::client_id"]
        [::std::mem::offset_of!(rd_kafka_group_member_info, client_id) - 8usize];
    ["Offset of field: rd_kafka_group_member_info::client_host"]
        [::std::mem::offset_of!(rd_kafka_group_member_info, client_host) - 16usize];
    ["Offset of field: rd_kafka_group_member_info::member_metadata"]
        [::std::mem::offset_of!(rd_kafka_group_member_info, member_metadata) - 24usize];
    ["Offset of field: rd_kafka_group_member_info::member_metadata_size"]
        [::std::mem::offset_of!(rd_kafka_group_member_info, member_metadata_size) - 32usize];
    ["Offset of field: rd_kafka_group_member_info::member_assignment"]
        [::std::mem::offset_of!(rd_kafka_group_member_info, member_assignment) - 40usize];
    ["Offset of field: rd_kafka_group_member_info::member_assignment_size"]
        [::std::mem::offset_of!(rd_kafka_group_member_info, member_assignment_size) - 48usize];
};
#[repr(u32)]
#[doc = " @enum rd_kafka_consumer_group_state_t\n\n @brief Consumer group state."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum rd_kafka_consumer_group_state_t {
    RD_KAFKA_CONSUMER_GROUP_STATE_UNKNOWN = 0,
    RD_KAFKA_CONSUMER_GROUP_STATE_PREPARING_REBALANCE = 1,
    RD_KAFKA_CONSUMER_GROUP_STATE_COMPLETING_REBALANCE = 2,
    RD_KAFKA_CONSUMER_GROUP_STATE_STABLE = 3,
    RD_KAFKA_CONSUMER_GROUP_STATE_DEAD = 4,
    RD_KAFKA_CONSUMER_GROUP_STATE_EMPTY = 5,
    RD_KAFKA_CONSUMER_GROUP_STATE__CNT = 6,
}
#[repr(u32)]
#[doc = " @enum rd_kafka_consumer_group_type_t\n\n @brief Consumer group type."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum rd_kafka_consumer_group_type_t {
    RD_KAFKA_CONSUMER_GROUP_TYPE_UNKNOWN = 0,
    RD_KAFKA_CONSUMER_GROUP_TYPE_CONSUMER = 1,
    RD_KAFKA_CONSUMER_GROUP_TYPE_CLASSIC = 2,
    RD_KAFKA_CONSUMER_GROUP_TYPE__CNT = 3,
}
#[doc = " @brief Group information"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rd_kafka_group_info {
    #[doc = "< Originating broker info"]
    pub broker: rd_kafka_metadata_broker,
    #[doc = "< Group name"]
    pub group: *mut ::std::os::raw::c_char,
    #[doc = "< Broker-originated error"]
    pub err: rd_kafka_resp_err_t,
    #[doc = "< Group state"]
    pub state: *mut ::std::os::raw::c_char,
    #[doc = "< Group protocol type"]
    pub protocol_type: *mut ::std::os::raw::c_char,
    #[doc = "< Group protocol"]
    pub protocol: *mut ::std::os::raw::c_char,
    #[doc = "< Group members"]
    pub members: *mut rd_kafka_group_member_info,
    #[doc = "< Group member count"]
    pub member_cnt: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rd_kafka_group_info"][::std::mem::size_of::<rd_kafka_group_info>() - 80usize];
    ["Alignment of rd_kafka_group_info"][::std::mem::align_of::<rd_kafka_group_info>() - 8usize];
    ["Offset of field: rd_kafka_group_info::broker"]
        [::std::mem::offset_of!(rd_kafka_group_info, broker) - 0usize];
    ["Offset of field: rd_kafka_group_info::group"]
        [::std::mem::offset_of!(rd_kafka_group_info, group) - 24usize];
    ["Offset of field: rd_kafka_group_info::err"]
        [::std::mem::offset_of!(rd_kafka_group_info, err) - 32usize];
    ["Offset of field: rd_kafka_group_info::state"]
        [::std::mem::offset_of!(rd_kafka_group_info, state) - 40usize];
    ["Offset of field: rd_kafka_group_info::protocol_type"]
        [::std::mem::offset_of!(rd_kafka_group_info, protocol_type) - 48usize];
    ["Offset of field: rd_kafka_group_info::protocol"]
        [::std::mem::offset_of!(rd_kafka_group_info, protocol) - 56usize];
    ["Offset of field: rd_kafka_group_info::members"]
        [::std::mem::offset_of!(rd_kafka_group_info, members) - 64usize];
    ["Offset of field: rd_kafka_group_info::member_cnt"]
        [::std::mem::offset_of!(rd_kafka_group_info, member_cnt) - 72usize];
};
#[doc = " @brief List of groups\n\n @sa rd_kafka_group_list_destroy() to release list memory."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rd_kafka_group_list {
    #[doc = "< Groups"]
    pub groups: *mut rd_kafka_group_info,
    #[doc = "< Group count"]
    pub group_cnt: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rd_kafka_group_list"][::std::mem::size_of::<rd_kafka_group_list>() - 16usize];
    ["Alignment of rd_kafka_group_list"][::std::mem::align_of::<rd_kafka_group_list>() - 8usize];
    ["Offset of field: rd_kafka_group_list::groups"]
        [::std::mem::offset_of!(rd_kafka_group_list, groups) - 0usize];
    ["Offset of field: rd_kafka_group_list::group_cnt"]
        [::std::mem::offset_of!(rd_kafka_group_list, group_cnt) - 8usize];
};
unsafe extern "C" {
